vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
#ifndef __IMAPX800_ISPOST_APOLLO3_REGS_H__
#define __IMAPX800_ISPOST_APOLLO3_REGS_H__


#if defined(__cplusplus)
extern "C" {
#endif //__cplusplus


// ISPOST base address
//#define ISPOST_PERI_BASE_ADDR                  ISPOST_BASE_ADDR


//==========================================================
// ISP post processor registers offset.
//----------------------------------------------------------
// ISPCTRL0 - ISPOST Control Register 0
#define ISPOST_ISPCTRL0_OFFSET                 (0x0000)
#define ISPOST_ISPCTRL0                        (ISPOST_PERI_BASE_ADDR + ISPOST_ISPCTRL0_OFFSET)

/*
 * ISPOST, ISPCTRL0, ALL_INT
 * [31:24] ALL_INT - All of Interrupt state.
 */
#define ISPOST_ISPCTRL0_ALL_INT_MASK          (0xFF000000)
#define ISPOST_ISPCTRL0_ALL_INT_LSBMASK       (0x000000FF)
#define ISPOST_ISPCTRL0_ALL_INT_SHIFT         (24)
#define ISPOST_ISPCTRL0_ALL_INT_LENGTH        (8)
#define ISPOST_ISPCTRL0_ALL_INT_DEFAULT       (0)
#define ISPOST_ISPCTRL0_ALL_INT_SIGNED_FIELD  (0)

/*
 * ISPOST, ISPCTRL0, LBERRINT
 * [27] LBERRINT - LC Line Buffer Error Interrupt state.
 */
#define ISPOST_ISPCTRL0_LBERRINT_MASK          (0x08000000)
#define ISPOST_ISPCTRL0_LBERRINT_LSBMASK       (0x00000001)
#define ISPOST_ISPCTRL0_LBERRINT_SHIFT         (27)
#define ISPOST_ISPCTRL0_LBERRINT_LENGTH        (1)
#define ISPOST_ISPCTRL0_LBERRINT_DEFAULT       (0)
#define ISPOST_ISPCTRL0_LBERRINT_SIGNED_FIELD  (0)

/*
 * ISPOST, ISPCTRL0, VSFWINT
 * [26] VSFWINT - VS Frame Write Interrupt state.
 */
#define ISPOST_ISPCTRL0_VSFWINT_MASK           (0x04000000)
#define ISPOST_ISPCTRL0_VSFWINT_LSBMASK        (0x00000001)
#define ISPOST_ISPCTRL0_VSFWINT_SHIFT          (26)
#define ISPOST_ISPCTRL0_VSFWINT_LENGTH         (1)
#define ISPOST_ISPCTRL0_VSFWINT_DEFAULT        (0)
#define ISPOST_ISPCTRL0_VSFWINT_SIGNED_FIELD   (0)

/*
 * ISPOST, ISPCTRL0, VSINT
 * [25] VSINT - VS Interrupt state.
 */
#define ISPOST_ISPCTRL0_VSINT_MASK             (0x02000000)
#define ISPOST_ISPCTRL0_VSINT_LSBMASK          (0x00000001)
#define ISPOST_ISPCTRL0_VSINT_SHIFT            (25)
#define ISPOST_ISPCTRL0_VSINT_LENGTH           (1)
#define ISPOST_ISPCTRL0_VSINT_DEFAULT          (0)
#define ISPOST_ISPCTRL0_VSINT_SIGNED_FIELD     (0)

/*
 * ISPOST, ISPCTRL0, INT
 * [24] INT - Interrupt state.
 */
#define ISPOST_ISPCTRL0_INT_MASK               (0x01000000)
#define ISPOST_ISPCTRL0_INT_LSBMASK            (0x00000001)
#define ISPOST_ISPCTRL0_INT_SHIFT              (24)
#define ISPOST_ISPCTRL0_INT_LENGTH             (1)
#define ISPOST_ISPCTRL0_INT_DEFAULT            (0)
#define ISPOST_ISPCTRL0_INT_SIGNED_FIELD       (0)

/*
 * ISPOST, ISPCTRL0, RSTVENCL
 * [23] RSTVENCL - Reset/initialize Video Encoder Link.
 */
#define ISPOST_ISPCTRL0_RSTVENCL_MASK          (0x00800000)
#define ISPOST_ISPCTRL0_RSTVENCL_LSBMASK       (0x00000001)
#define ISPOST_ISPCTRL0_RSTVENCL_SHIFT         (23)
#define ISPOST_ISPCTRL0_RSTVENCL_LENGTH        (1)
#define ISPOST_ISPCTRL0_RSTVENCL_DEFAULT       (0)
#define ISPOST_ISPCTRL0_RSTVENCL_SIGNED_FIELD  (0)

/*
 * ISPOST, ISPCTRL0, ENDNWR
 * [21] ENDNWR - Enable Denoise Write.
 */
#define ISPOST_ISPCTRL0_ENDNWR_MASK            (0x00200000)
#define ISPOST_ISPCTRL0_ENDNWR_LSBMASK         (0x00000001)
#define ISPOST_ISPCTRL0_ENDNWR_SHIFT           (21)
#define ISPOST_ISPCTRL0_ENDNWR_LENGTH          (1)
#define ISPOST_ISPCTRL0_ENDNWR_DEFAULT         (0)
#define ISPOST_ISPCTRL0_ENDNWR_SIGNED_FIELD    (0)

/*
 * ISPOST, ISPCTRL0, ENUO
 * [20] ENUO - Enable Unscaled Output.
 */
#define ISPOST_ISPCTRL0_ENUO_MASK              (0x00100000)
#define ISPOST_ISPCTRL0_ENUO_LSBMASK           (0x00000001)
#define ISPOST_ISPCTRL0_ENUO_SHIFT             (20)
#define ISPOST_ISPCTRL0_ENUO_LENGTH            (1)
#define ISPOST_ISPCTRL0_ENUO_DEFAULT           (0)
#define ISPOST_ISPCTRL0_ENUO_SIGNED_FIELD      (0)

/*
 * ISPOST, ISPCTRL0, ENLCLB
 * [16] ENLCLB - Enable LC Line Buffer.
 */
#define ISPOST_ISPCTRL0_ENLCLB_MASK            (0x00010000)
#define ISPOST_ISPCTRL0_ENLCLB_LSBMASK         (0x00000001)
#define ISPOST_ISPCTRL0_ENLCLB_SHIFT           (16)
#define ISPOST_ISPCTRL0_ENLCLB_LENGTH          (1)
#define ISPOST_ISPCTRL0_ENLCLB_DEFAULT         (0)
#define ISPOST_ISPCTRL0_ENLCLB_SIGNED_FIELD    (0)

/*
 * ISPOST, ISPCTRL0, ENVENCL
 * [15] ENVENCL - Enable Video Encoder Link.
 */
#define ISPOST_ISPCTRL0_ENVENCL_MASK           (0x00008000)
#define ISPOST_ISPCTRL0_ENVENCL_LSBMASK        (0x00000001)
#define ISPOST_ISPCTRL0_ENVENCL_SHIFT          (15)
#define ISPOST_ISPCTRL0_ENVENCL_LENGTH         (1)
#define ISPOST_ISPCTRL0_ENVENCL_DEFAULT        (0)
#define ISPOST_ISPCTRL0_ENVENCL_SIGNED_FIELD   (0)

/*
 * ISPOST, ISPCTRL0, ENVSR
 * [14] ENVSR - Enable Video Stabilization Image Registration (Frame Buffer Input).
 */
#define ISPOST_ISPCTRL0_ENVSR_MASK             (0x00004000)
#define ISPOST_ISPCTRL0_ENVSR_LSBMASK          (0x00000001)
#define ISPOST_ISPCTRL0_ENVSR_SHIFT            (14)
#define ISPOST_ISPCTRL0_ENVSR_LENGTH           (1)
#define ISPOST_ISPCTRL0_ENVSR_DEFAULT          (0)
#define ISPOST_ISPCTRL0_ENVSR_SIGNED_FIELD     (0)

/*
 * ISPOST, ISPCTRL0, ENVSRC
 * [13] ENVSRC - Enable Video Stabilization Image Registration (Core).
 */
#define ISPOST_ISPCTRL0_ENVSRC_MASK            (0x00002000)
#define ISPOST_ISPCTRL0_ENVSRC_LSBMASK         (0x00000001)
#define ISPOST_ISPCTRL0_ENVSRC_SHIFT           (13)
#define ISPOST_ISPCTRL0_ENVSRC_LENGTH          (1)
#define ISPOST_ISPCTRL0_ENVSRC_DEFAULT         (0)
#define ISPOST_ISPCTRL0_ENVSRC_SIGNED_FIELD    (0)

/*
 * ISPOST, ISPCTRL0, ENSS1
 * [12] ENSS1 - Enable Scaled Stream 1.
 */
#define ISPOST_ISPCTRL0_ENSS1_MASK             (0x00001000)
#define ISPOST_ISPCTRL0_ENSS1_LSBMASK          (0x00000001)
#define ISPOST_ISPCTRL0_ENSS1_SHIFT            (12)
#define ISPOST_ISPCTRL0_ENSS1_LENGTH           (1)
#define ISPOST_ISPCTRL0_ENSS1_DEFAULT          (0)
#define ISPOST_ISPCTRL0_ENSS1_SIGNED_FIELD     (0)

/*
 * ISPOST, ISPCTRL0, ENSS0
 * [11] ENSS0 - Enable Scaled Stream 0.
 */
#define ISPOST_ISPCTRL0_ENSS0_MASK             (0x00000800)
#define ISPOST_ISPCTRL0_ENSS0_LSBMASK          (0x00000001)
#define ISPOST_ISPCTRL0_ENSS0_SHIFT            (11)
#define ISPOST_ISPCTRL0_ENSS0_LENGTH           (1)
#define ISPOST_ISPCTRL0_ENSS0_DEFAULT          (0)
#define ISPOST_ISPCTRL0_ENSS0_SIGNED_FIELD     (0)

