vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, ISPCTRL0, ENDN
 * [10] ENDN - Enable Denoise module.
 */
#define ISPOST_ISPCTRL0_ENDN_MASK              (0x00000400)
#define ISPOST_ISPCTRL0_ENDN_LSBMASK           (0x00000001)
#define ISPOST_ISPCTRL0_ENDN_SHIFT             (10)
#define ISPOST_ISPCTRL0_ENDN_LENGTH            (1)
#define ISPOST_ISPCTRL0_ENDN_DEFAULT           (0)
#define ISPOST_ISPCTRL0_ENDN_SIGNED_FIELD      (0)

/*
 * ISPOST, ISPCTRL0, ENOV
 * [9] ENOV - Enable Overlay module.
 */
#define ISPOST_ISPCTRL0_ENOV_MASK              (0x00000200)
#define ISPOST_ISPCTRL0_ENOV_LSBMASK           (0x00000001)
#define ISPOST_ISPCTRL0_ENOV_SHIFT             (9)
#define ISPOST_ISPCTRL0_ENOV_LENGTH            (1)
#define ISPOST_ISPCTRL0_ENOV_DEFAULT           (0)
#define ISPOST_ISPCTRL0_ENOV_SIGNED_FIELD      (0)

/*
 * ISPOST, ISPCTRL0, ENLC
 * [8] ENLC - Enable Lens Correction module.
 */
#define ISPOST_ISPCTRL0_ENLC_MASK              (0x00000100)
#define ISPOST_ISPCTRL0_ENLC_LSBMASK           (0x00000001)
#define ISPOST_ISPCTRL0_ENLC_SHIFT             (8)
#define ISPOST_ISPCTRL0_ENLC_LENGTH            (1)
#define ISPOST_ISPCTRL0_ENLC_DEFAULT           (0)
#define ISPOST_ISPCTRL0_ENLC_SIGNED_FIELD      (0)

/*
 * ISPOST, ISPCTRL0, RSTISPL
 * [7] RSTISPL - Reset/initialize ISP Link.
 */
#define ISPOST_ISPCTRL0_RSTISPL_MASK           (0x00000080)
#define ISPOST_ISPCTRL0_RSTISPL_LSBMASK        (0x00000001)
#define ISPOST_ISPCTRL0_RSTISPL_SHIFT          (7)
#define ISPOST_ISPCTRL0_RSTISPL_LENGTH         (1)
#define ISPOST_ISPCTRL0_RSTISPL_DEFAULT        (0)
#define ISPOST_ISPCTRL0_RSTISPL_SIGNED_FIELD   (0)

/*
 * ISPOST, ISPCTRL0, ENISPL
 * [6] ENISPL - Enable ISP Post processor ISP Link.
 */
#define ISPOST_ISPCTRL0_ENISPL_MASK            (0x00000040)
#define ISPOST_ISPCTRL0_ENISPL_LSBMASK         (0x00000001)
#define ISPOST_ISPCTRL0_ENISPL_SHIFT           (6)
#define ISPOST_ISPCTRL0_ENISPL_LENGTH          (1)
#define ISPOST_ISPCTRL0_ENISPL_DEFAULT         (0)
#define ISPOST_ISPCTRL0_ENISPL_SIGNED_FIELD    (0)

/*
 * ISPOST, ISPCTRL0, RSTVS
 * [5] RSTVS - Reset/initialize module group: VS LMV (necessary before enabling).
 */
#define ISPOST_ISPCTRL0_RSTVS_MASK            (0x00000020)
#define ISPOST_ISPCTRL0_RSTVS_LSBMASK         (0x00000001)
#define ISPOST_ISPCTRL0_RSTVS_SHIFT           (5)
#define ISPOST_ISPCTRL0_RSTVS_LENGTH          (1)
#define ISPOST_ISPCTRL0_RSTVS_DEFAULT         (0)
#define ISPOST_ISPCTRL0_RSTVS_SIGNED_FIELD    (0)

/*
 * ISPOST, ISPCTRL0, ENVS
 * [4] ENVS - Enable ISP Post processor module group: VS LMV.
 */
#define ISPOST_ISPCTRL0_ENVS_MASK             (0x00000010)
#define ISPOST_ISPCTRL0_ENVS_LSBMASK          (0x00000001)
#define ISPOST_ISPCTRL0_ENVS_SHIFT            (4)
#define ISPOST_ISPCTRL0_ENVS_LENGTH           (1)
#define ISPOST_ISPCTRL0_ENVS_DEFAULT          (0)
#define ISPOST_ISPCTRL0_ENVS_SIGNED_FIELD     (0)

/*
 * ISPOST, ISPCTRL0, RSTILC
 * [3] RSTILC - Reset/initialize module group: LC (necessary before enabling).
 */
#define ISPOST_ISPCTRL0_RSTILC_MASK           (0x00000008)
#define ISPOST_ISPCTRL0_RSTILC_LSBMASK        (0x00000001)
#define ISPOST_ISPCTRL0_RSTILC_SHIFT          (3)
#define ISPOST_ISPCTRL0_RSTILC_LENGTH         (1)
#define ISPOST_ISPCTRL0_RSTILC_DEFAULT        (0)
#define ISPOST_ISPCTRL0_RSTILC_SIGNED_FIELD   (0)

/*
 * ISPOST, ISPCTRL0, ENILC
 * [2] ENILC - Enable ISP Post processor module group: LC.
 */
#define ISPOST_ISPCTRL0_ENILC_MASK            (0x00000004)
#define ISPOST_ISPCTRL0_ENILC_LSBMASK         (0x00000001)
#define ISPOST_ISPCTRL0_ENILC_SHIFT           (2)
#define ISPOST_ISPCTRL0_ENILC_LENGTH          (1)
#define ISPOST_ISPCTRL0_ENILC_DEFAULT         (0)
#define ISPOST_ISPCTRL0_ENILC_SIGNED_FIELD    (0)

/*
 * ISPOST, ISPCTRL0, RST
 * [1] RST - Reset/initialize module group: VS IR, OV, O, SS0, SS1, VO, VENC link (necessary before enabling).
 */
#define ISPOST_ISPCTRL0_RST_MASK               (0x00000002)
#define ISPOST_ISPCTRL0_RST_LSBMASK            (0x00000001)
#define ISPOST_ISPCTRL0_RST_SHIFT              (1)
#define ISPOST_ISPCTRL0_RST_LENGTH             (1)
#define ISPOST_ISPCTRL0_RST_DEFAULT            (0)
#define ISPOST_ISPCTRL0_RST_SIGNED_FIELD       (0)

/*
 * ISPOST, ISPCTRL0, EN
 * [0] EN- Enable ISP Post processor module group: VS IR, OV, O, SS0, SS1, VO, VENC link.
 */
#define ISPOST_ISPCTRL0_EN_MASK                (0x00000001)
#define ISPOST_ISPCTRL0_EN_LSBMASK             (0x00000001)
#define ISPOST_ISPCTRL0_EN_SHIFT               (0)
#define ISPOST_ISPCTRL0_EN_LENGTH              (1)
#define ISPOST_ISPCTRL0_EN_DEFAULT             (0)
#define ISPOST_ISPCTRL0_EN_SIGNED_FIELD        (0)


//----------------------------------------------------------
// ISPSTAT0 - ISPOST Status Register 0.
#define ISPOST_ISPSTAT0_OFFSET                 (0x0004)
#define ISPOST_ISPSTAT0                        (ISPOST_PERI_BASE_ADDR + ISPOST_ISPSTAT0_OFFSET)

/*
 * ISPOST, ISPSTAT0, LBERR
 * [8] LBERR - Video stabilization frame output run status.
 */
#define ISPOST_ISPSTAT0_LBERR_MASK             (0x00000100)
#define ISPOST_ISPSTAT0_LBERR_LSBMASK          (0x00000001)
#define ISPOST_ISPSTAT0_LBERR_SHIFT            (8)
#define ISPOST_ISPSTAT0_LBERR_LENGTH           (1)
#define ISPOST_ISPSTAT0_LBERR_DEFAULT          (0)
#define ISPOST_ISPSTAT0_LBERR_SIGNED_FIELD     (0)

/*
 * ISPOST, ISPSTAT0, STAT_VO
 * [6] STAT_VO - Video Output run status.
 */
#define ISPOST_ISPSTAT0_STAT_VO_MASK           (0x00000040)
#define ISPOST_ISPSTAT0_STAT_VO_LSBMASK        (0x00000001)
#define ISPOST_ISPSTAT0_STAT_VO_SHIFT          (6)
#define ISPOST_ISPSTAT0_STAT_VO_LENGTH         (1)
#define ISPOST_ISPSTAT0_STAT_VO_DEFAULT        (0)
#define ISPOST_ISPSTAT0_STAT_VO_SIGNED_FIELD   (0)

/*
 * ISPOST, ISPSTAT0, STAT2
 * [5] STAT2 - Video stabilization frame output run status.
 */
#define ISPOST_ISPSTAT0_STAT2_MASK             (0x00000020)
#define ISPOST_ISPSTAT0_STAT2_LSBMASK          (0x00000001)
#define ISPOST_ISPSTAT0_STAT2_SHIFT            (5)
#define ISPOST_ISPSTAT0_STAT2_LENGTH           (1)
#define ISPOST_ISPSTAT0_STAT2_DEFAULT          (0)
#define ISPOST_ISPSTAT0_STAT2_SIGNED_FIELD     (0)

