vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, ISPSTAT0, STAT1
 * [4] STAT1 - Video stabilization motion vector estimation run status.
 */
#define ISPOST_ISPSTAT0_STAT1_MASK             (0x00000010)
#define ISPOST_ISPSTAT0_STAT1_LSBMASK          (0x00000001)
#define ISPOST_ISPSTAT0_STAT1_SHIFT            (4)
#define ISPOST_ISPSTAT0_STAT1_LENGTH           (1)
#define ISPOST_ISPSTAT0_STAT1_DEFAULT          (0)
#define ISPOST_ISPSTAT0_STAT1_SIGNED_FIELD     (0)

/*
 * ISPOST, ISPSTAT0, STAT_SS1
 * [3] STAT_SS1 - Scaled Stream 1 run status.
 */
#define ISPOST_ISPSTAT0_STAT_SS1_MASK          (0x00000008)
#define ISPOST_ISPSTAT0_STAT_SS1_LSBMASK       (0x00000001)
#define ISPOST_ISPSTAT0_STAT_SS1_SHIFT         (3)
#define ISPOST_ISPSTAT0_STAT_SS1_LENGTH        (1)
#define ISPOST_ISPSTAT0_STAT_SS1_DEFAULT       (0)
#define ISPOST_ISPSTAT0_STAT_SS1_SIGNED_FIELD  (0)

/*
 * ISPOST, ISPSTAT0, STAT_SS0
 * [2] STAT_SS0 - Scaled Stream 0 run status.
 */
#define ISPOST_ISPSTAT0_STAT_SS0_MASK          (0x00000004)
#define ISPOST_ISPSTAT0_STAT_SS0_LSBMASK       (0x00000001)
#define ISPOST_ISPSTAT0_STAT_SS0_SHIFT         (2)
#define ISPOST_ISPSTAT0_STAT_SS0_LENGTH        (1)
#define ISPOST_ISPSTAT0_STAT_SS0_DEFAULT       (0)
#define ISPOST_ISPSTAT0_STAT_SS0_SIGNED_FIELD  (0)

/*
 * ISPOST, ISPSTAT0, STAT_UO
 * [1] STAT_UO - Unscaled Output run status.
 */
#define ISPOST_ISPSTAT0_STAT_UO_MASK           (0x00000002)
#define ISPOST_ISPSTAT0_STAT_UO_LSBMASK        (0x00000001)
#define ISPOST_ISPSTAT0_STAT_UO_SHIFT          (1)
#define ISPOST_ISPSTAT0_STAT_UO_LENGTH         (1)
#define ISPOST_ISPSTAT0_STAT_UO_DEFAULT        (0)
#define ISPOST_ISPSTAT0_STAT_UO_SIGNED_FIELD   (0)

/*
 * ISPOST, ISPSTAT0, STAT0
 * [0] STAT0 - ISPOST run status.
 */
#define ISPOST_ISPSTAT0_STAT0_MASK             (0x00000001)
#define ISPOST_ISPSTAT0_STAT0_LSBMASK          (0x00000001)
#define ISPOST_ISPSTAT0_STAT0_SHIFT            (0)
#define ISPOST_ISPSTAT0_STAT0_LENGTH           (1)
#define ISPOST_ISPSTAT0_STAT0_DEFAULT          (0)
#define ISPOST_ISPSTAT0_STAT0_SIGNED_FIELD     (0)



//==========================================================
// Lens distortion correction registers offset.
//----------------------------------------------------------
// LCSRCAY - LC Source Image Y Plane Start Address Register.
#define ISPOST_LCSRCAY_OFFSET                  (0x0008)
#define ISPOST_LCSRCAY                         (ISPOST_PERI_BASE_ADDR + ISPOST_LCSRCAY_OFFSET)

/*
 * ISPOST, LCSRCAY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_LCSRCAY_SAD_MASK                (0xFFFFFFF8)
#define ISPOST_LCSRCAY_SAD_LSBMASK             (0xFFFFFFF8)
#define ISPOST_LCSRCAY_SAD_SHIFT               (0)
#define ISPOST_LCSRCAY_SAD_LENGTH              (32)
#define ISPOST_LCSRCAY_SAD_DEFAULT             (0)
#define ISPOST_LCSRCAY_SAD_SIGNED_FIELD        (0)


//----------------------------------------------------------
// LCSRCAUV - LC Source Image UV Plane Start Address Register.
#define ISPOST_LCSRCAUV_OFFSET                 (0x0010)
#define ISPOST_LCSRCAUV                        (ISPOST_PERI_BASE_ADDR + ISPOST_LCSRCAUV_OFFSET)

/*
 * ISPOST, LCSRCAUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_LCSRCAUV_SAD_MASK               (0xFFFFFFF8)
#define ISPOST_LCSRCAUV_SAD_LSBMASK            (0xFFFFFFF8)
#define ISPOST_LCSRCAUV_SAD_SHIFT              (0)
#define ISPOST_LCSRCAUV_SAD_LENGTH             (32)
#define ISPOST_LCSRCAUV_SAD_DEFAULT            (0)
#define ISPOST_LCSRCAUV_SAD_SIGNED_FIELD       (0)


//----------------------------------------------------------
// LCSRCS - LC Source Image Stride Register.
#define ISPOST_LCSRCS_OFFSET                   (0x0014)
#define ISPOST_LCSRCS                          (ISPOST_PERI_BASE_ADDR + ISPOST_LCSRCS_OFFSET)

/*
 * ISPOST, LCSRCS, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_LCSRCS_SD_MASK                  (0x00001FF8)
#define ISPOST_LCSRCS_SD_LSBMASK               (0x00001FF8)
#define ISPOST_LCSRCS_SD_SHIFT                 (0)
#define ISPOST_LCSRCS_SD_LENGTH                (13)
#define ISPOST_LCSRCS_SD_DEFAULT               (0)
#define ISPOST_LCSRCS_SD_SIGNED_FIELD          (0)


//----------------------------------------------------------
// LCSRCSZ - LC Source Image Size Register.
#define ISPOST_LCSRCSZ_OFFSET                  (0x0018)
#define ISPOST_LCSRCSZ                         (ISPOST_PERI_BASE_ADDR + ISPOST_LCSRCSZ_OFFSET)

/*
 * ISPOST, LCSRCSZ, W
 * [28:16] W - Image width (pixel granularity).
 */
#define ISPOST_LCSRCSZ_W_MASK                  (0x1FFF0000)
#define ISPOST_LCSRCSZ_W_LSBMASK               (0x00001FFF)
#define ISPOST_LCSRCSZ_W_SHIFT                 (16)
#define ISPOST_LCSRCSZ_W_LENGTH                (13)
#define ISPOST_LCSRCSZ_W_DEFAULT               (0)
#define ISPOST_LCSRCSZ_W_SIGNED_FIELD          (0)

/*
 * ISPOST, LCSRCSZ, H
 * [12:0] H - Image height (line granularity).
 */
#define ISPOST_LCSRCSZ_H_MASK                  (0x00001FFF)
#define ISPOST_LCSRCSZ_H_LSBMASK               (0x00001FFF)
#define ISPOST_LCSRCSZ_H_SHIFT                 (0)
#define ISPOST_LCSRCSZ_H_LENGTH                (13)
#define ISPOST_LCSRCSZ_H_DEFAULT               (0)
#define ISPOST_LCSRCSZ_H_SIGNED_FIELD          (0)


//----------------------------------------------------------
// LCSRCBFC - LC Source Image Back Fill Color Register.
#define ISPOST_LCSRCBFC_OFFSET                 (0x001C)
#define ISPOST_LCSRCBFC                        (ISPOST_PERI_BASE_ADDR + ISPOST_LCSRCBFC_OFFSET)

/*
 * ISPOST, LCSRCBFC, Y
 * [23:16] Y - Source Back Fill Y component value. (0-255).
 */
#define ISPOST_LCSRCBFC_Y_MASK                 (0x00FF0000)
#define ISPOST_LCSRCBFC_Y_LSBMASK              (0x000000FF)
#define ISPOST_LCSRCBFC_Y_SHIFT                (16)
#define ISPOST_LCSRCBFC_Y_LENGTH               (8)
#define ISPOST_LCSRCBFC_Y_DEFAULT              (0)
#define ISPOST_LCSRCBFC_Y_SIGNED_FIELD         (0)

/*
 * ISPOST, LCSRCBFC, CB
 * [15:8] CB - Source Back Fill CB component value (0-255).
 */
#define ISPOST_LCSRCBFC_CB_MASK                (0x0000FF00)
#define ISPOST_LCSRCBFC_CB_LSBMASK             (0x000000FF)
#define ISPOST_LCSRCBFC_CB_SHIFT               (8)
#define ISPOST_LCSRCBFC_CB_LENGTH              (8)
#define ISPOST_LCSRCBFC_CB_DEFAULT             (0)
#define ISPOST_LCSRCBFC_CB_SIGNED_FIELD        (0)

