vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, LCSRCBFC, CR
 * [7:0] CR - Source Back Fill CR component value (0-255).
 */
#define ISPOST_LCSRCBFC_CR_MASK                (0x000000FF)
#define ISPOST_LCSRCBFC_CR_LSBMASK             (0x000000FF)
#define ISPOST_LCSRCBFC_CR_SHIFT               (0)
#define ISPOST_LCSRCBFC_CR_LENGTH              (8)
#define ISPOST_LCSRCBFC_CR_DEFAULT             (0)
#define ISPOST_LCSRCBFC_CR_SIGNED_FIELD        (0)


//----------------------------------------------------------
// LCGBA - LC Grid Buffer Start Address Register.
#define ISPOST_LCGBA_OFFSET                    (0x0020)
#define ISPOST_LCGBA                           (ISPOST_PERI_BASE_ADDR + ISPOST_LCGBA_OFFSET)

/*
 * ISPOST, LCGBA, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_LCGBA_SAD_MASK                  (0xFFFFFFF8)
#define ISPOST_LCGBA_SAD_LSBMASK               (0xFFFFFFF8)
#define ISPOST_LCGBA_SAD_SHIFT                 (0)
#define ISPOST_LCGBA_SAD_LENGTH                (32)
#define ISPOST_LCGBA_SAD_DEFAULT               (0)
#define ISPOST_LCGBA_SAD_SIGNED_FIELD          (0)


//----------------------------------------------------------
// LCGBS - LC Grid Buffer Stride Register.
#define ISPOST_LCGBS_OFFSET                    (0x0024)
#define ISPOST_LCGBS                           (ISPOST_PERI_BASE_ADDR + ISPOST_LCGBS_OFFSET)

/*
 * ISPOST, LCGBS, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_LCGBS_SD_MASK                   (0x00001FF8)
#define ISPOST_LCGBS_SD_LSBMASK                (0x00001FF8)
#define ISPOST_LCGBS_SD_SHIFT                  (0)
#define ISPOST_LCGBS_SD_LENGTH                 (13)
#define ISPOST_LCGBS_SD_DEFAULT                (0)
#define ISPOST_LCGBS_SD_SIGNED_FIELD           (0)


//----------------------------------------------------------
// LCGBSZ - LC Grid Size Register.
#define ISPOST_LCGBSZ_OFFSET                   (0x0028)
#define ISPOST_LCGBSZ                          (ISPOST_PERI_BASE_ADDR + ISPOST_LCGBSZ_OFFSET)

/*
 * ISPOST, LCGBSZ, LBEN
 * [8] LBEN - Grid line buffer enable.
 */
#define ISPOST_LCGBSZ_LBEN_MASK                (0x00000100)
#define ISPOST_LCGBSZ_LBEN_LSBMASK             (0x00000001)
#define ISPOST_LCGBSZ_LBEN_SHIFT               (8)
#define ISPOST_LCGBSZ_LBEN_LENGTH              (1)
#define ISPOST_LCGBSZ_LBEN_DEFAULT             (0)
#define ISPOST_LCGBSZ_LBEN_SIGNED_FIELD        (0)

/*
 * ISPOST, LCGBSZ, SIZE
 * [1:0] SIZE - LC grid size.
 *       00 : 8x8 pixels.
 *       01 : 16x16 pixels.
 *       10 : 32x32 pixels.
 *       11 : Reserved.
 */
#define ISPOST_LCGBSZ_SIZE_MASK                (0x00000003)
#define ISPOST_LCGBSZ_SIZE_LSBMASK             (0x00000003)
#define ISPOST_LCGBSZ_SIZE_SHIFT               (0)
#define ISPOST_LCGBSZ_SIZE_LENGTH              (2)
#define ISPOST_LCGBSZ_SIZE_DEFAULT             (0)
#define ISPOST_LCGBSZ_SIZE_SIGNED_FIELD        (0)


//----------------------------------------------------------
// LCLBERR - LC Line Buffer Error Register.
#define ISPOST_LCLBERR_OFFSET                  (0x002C)
#define ISPOST_LCLBERR                         (ISPOST_PERI_BASE_ADDR + ISPOST_LCLBERR_OFFSET)

/*
 * ISPOST, LCLBERR, ERROR
 * [31:0] ERROR - Line Buffer error information.
 */
#define ISPOST_LCLBERR_ERROR_MASK              (0xFFFFFFFF)
#define ISPOST_LCLBERR_ERROR_LSBMASK           (0xFFFFFFFF)
#define ISPOST_LCLBERR_ERROR_SHIFT             (0)
#define ISPOST_LCLBERR_ERROR_LENGTH            (32)
#define ISPOST_LCLBERR_ERROR_DEFAULT           (0)
#define ISPOST_LCLBERR_ERROR_SIGNED_FIELD      (0)


//----------------------------------------------------------
// LCPCM - LC Pixel Cache, Line Buffer Mode Register.
#define ISPOST_LCPCM_OFFSET                    (0x0030)
#define ISPOST_LCPCM                           (ISPOST_PERI_BASE_ADDR + ISPOST_LCPCM_OFFSET)

/*
 * ISPOST, LCPCM, WLBE
 * [11] WLBE - Wait for Line Buffer End Image before LC signals done interrupt.
 *             0 : STACK.
 *                 When stack is full, the new error info will not be pushed, to store first 8 error info entries
 *             1 : FIFO
 *                 When fifo is full, the earliest error info will be dropped, to store latest 8 error info entries
 */
#define ISPOST_LCPCM_WLBE_MASK                 (0x00000800)
#define ISPOST_LCPCM_WLBE_LSBMASK              (0x00000001)
#define ISPOST_LCPCM_WLBE_SHIFT                (11)
#define ISPOST_LCPCM_WLBE_LENGTH               (1)
#define ISPOST_LCPCM_WLBE_DEFAULT              (0)
#define ISPOST_LCPCM_WLBE_SIGNED_FIELD         (0)

/*
 * ISPOST, LCPCM, FIFO_TYPE
 * [10] FIFO_TYPE - Line Buffer Error FIFO Type.
 */
#define ISPOST_LCPCM_FIFO_TYPE_MASK            (0x00000400)
#define ISPOST_LCPCM_FIFO_TYPE_LSBMASK         (0x00000001)
#define ISPOST_LCPCM_FIFO_TYPE_SHIFT           (10)
#define ISPOST_LCPCM_FIFO_TYPE_LENGTH          (1)
#define ISPOST_LCPCM_FIFO_TYPE_DEFAULT         (0)
#define ISPOST_LCPCM_FIFO_TYPE_SIGNED_FIELD    (0)

/*
 * ISPOST, LCPCM, LBFMT
 * [9:8] LBFMT - Line Buffer Internal Format.
 */
#define ISPOST_LCPCM_LBFMT_MASK                (0x00000300)
#define ISPOST_LCPCM_LBFMT_LSBMASK             (0x00000003)
#define ISPOST_LCPCM_LBFMT_SHIFT               (8)
#define ISPOST_LCPCM_LBFMT_LENGTH              (2)
#define ISPOST_LCPCM_LBFMT_DEFAULT             (0)
#define ISPOST_LCPCM_LBFMT_SIGNED_FIELD        (0)

/*
 * ISPOST, LCPCM, PREF
 * [6:2] PREF - Cache controller cfg value.
 */
#define ISPOST_LCPCM_PREF_MASK                 (0x0000007C)
#define ISPOST_LCPCM_PREF_LSBMASK              (0x0000001F)
#define ISPOST_LCPCM_PREF_SHIFT                (2)
#define ISPOST_LCPCM_PREF_LENGTH               (5)
#define ISPOST_LCPCM_PREF_DEFAULT              (0)
#define ISPOST_LCPCM_PREF_SIGNED_FIELD         (0)

/*
 * ISPOST, LCPCM, CDSS
 * [6:5] CDSS - cache data shape select.
 *              Allowed values are from 0 to 3, for fisheye cfg = 2 or cfg = 3 is better.
 */
#define ISPOST_LCPCM_CDSS_MASK                 (0x00000060)
#define ISPOST_LCPCM_CDSS_LSBMASK              (0x00000003)
#define ISPOST_LCPCM_CDSS_SHIFT                (5)
#define ISPOST_LCPCM_CDSS_LENGTH               (2)
#define ISPOST_LCPCM_CDSS_DEFAULT              (0)
#define ISPOST_LCPCM_CDSS_SIGNED_FIELD         (0)

