vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, LCPCM, BLS
 * [4] BLS - Burst length select.
 *           0 : 4QW.
 *           1 : 8QW.
 *           Suggestion: For barrel distortion uses 8QW, fisheye uses 4QW
 */
#define ISPOST_LCPCM_BLS_MASK                  (0x00000010)
#define ISPOST_LCPCM_BLS_LSBMASK               (0x00000001)
#define ISPOST_LCPCM_BLS_SHIFT                 (4)
#define ISPOST_LCPCM_BLS_LENGTH                (1)
#define ISPOST_LCPCM_BLS_DEFAULT               (0)
#define ISPOST_LCPCM_BLS_SIGNED_FIELD          (0)

/*
 * ISPOST, LCPCM, PREFCTRL
 * Bit[3:2] PREFCTRL - Pre-fetch control.
 *                     Bit3: Disable main pixel fifo function. Value =1 means disable.
 *                     Bit2: Disable pre-fetch function. Value =1 means disable.
 */
#define ISPOST_LCPCM_PREFCTRL_MASK             (0x0000000C)
#define ISPOST_LCPCM_PREFCTRL_LSBMASK          (0x00000003)
#define ISPOST_LCPCM_PREFCTRL_SHIFT            (2)
#define ISPOST_LCPCM_PREFCTRL_LENGTH           (2)
#define ISPOST_LCPCM_PREFCTRL_DEFAULT          (0)
#define ISPOST_LCPCM_PREFCTRL_SIGNED_FIELD     (0)

/*
 * ISPOST, LCPCM, CBCRSWAP
 * [0] CBCRSWAP - CB/CR swap - 0: No swap, 1: swap.
 */
#define ISPOST_LCPCM_CBCRSWAP_MASK             (0x00000001)
#define ISPOST_LCPCM_CBCRSWAP_LSBMASK          (0x00000001)
#define ISPOST_LCPCM_CBCRSWAP_SHIFT            (0)
#define ISPOST_LCPCM_CBCRSWAP_LENGTH           (1)
#define ISPOST_LCPCM_CBCRSWAP_DEFAULT          (0)
#define ISPOST_LCPCM_CBCRSWAP_SIGNED_FIELD     (0)


//----------------------------------------------------------
// LCPGM - LC Pixel Coordinate Generator Mode Register.
#define ISPOST_LCPGM_OFFSET                    (0x0034)
#define ISPOST_LCPGM                           (ISPOST_PERI_BASE_ADDR + ISPOST_LCPGM_OFFSET)

/*
 * ISPOST, LCPGM, SCANW
 * [9:8] SCANW - scan width.
 *               00 : 8.
 *               01 : 16.
 *               10 : 32.
 *               11 : Reserved.
 */
#define ISPOST_LCPGM_SCANW_MASK                (0x00000300)
#define ISPOST_LCPGM_SCANW_LSBMASK             (0x00000003)
#define ISPOST_LCPGM_SCANW_SHIFT               (8)
#define ISPOST_LCPGM_SCANW_LENGTH              (2)
#define ISPOST_LCPGM_SCANW_DEFAULT             (0)
#define ISPOST_LCPGM_SCANW_SIGNED_FIELD        (0)

/*
 * ISPOST, LCPGM, SCANH
 * [5:4] SCANH - scan height.
 *               00 : 8.
 *               01 : 16.
 *               10 : 32.
 *               11 : 2.
 *               NOTE: Use SCANH=16 for compatibility with direct link to video codec when VSIR frame buffer is disabled,
 *                         SCANH=2 is required if VS LMV block is active,
 *                         SCANH=2 can be used with line buffer enabled and VSIR frame buffer for best performance.
 */
#define ISPOST_LCPGM_SCANH_MASK                (0x00000030)
#define ISPOST_LCPGM_SCANH_LSBMASK             (0x00000003)
#define ISPOST_LCPGM_SCANH_SHIFT               (4)
#define ISPOST_LCPGM_SCANH_LENGTH              (2)
#define ISPOST_LCPGM_SCANH_DEFAULT             (0)
#define ISPOST_LCPGM_SCANH_SIGNED_FIELD        (0)

/*
 * ISPOST, LCPGM, SCANM
 * [2:0] SCANM - scan mode.
 *               000 : LR (left → right), TB (top → bottom).
 *               001 : LR, BT.
 *               010 : RL, TB.
 *               011 : RL, BT.
 *               100 : TB (top → bottom), LR (left → right).
 *               101 : BT, LR.
 *               110 : TB, RL.
 *               111 : BT, RL.
 */
#define ISPOST_LCPGM_SCANM_MASK                (0x00000007)
#define ISPOST_LCPGM_SCANM_LSBMASK             (0x00000007)
#define ISPOST_LCPGM_SCANM_SHIFT               (0)
#define ISPOST_LCPGM_SCANM_LENGTH              (3)
#define ISPOST_LCPGM_SCANM_DEFAULT             (0)
#define ISPOST_LCPGM_SCANM_SIGNED_FIELD        (0)


//----------------------------------------------------------
// LCPGSZ - LC Pixel Coordinate Generator Destination Size Register.
#define ISPOST_LCPGSZ_OFFSET                   (0x0038)
#define ISPOST_LCPGSZ                          (ISPOST_PERI_BASE_ADDR + ISPOST_LCPGSZ_OFFSET)

/*
 * ISPOST, LCPGSZ, W
 * [28:16] W - Destination image width (pixel granularity).
 */
#define ISPOST_LCPGSZ_W_MASK                   (0x1FFF0000)
#define ISPOST_LCPGSZ_W_LSBMASK                (0x00001FFF)
#define ISPOST_LCPGSZ_W_SHIFT                  (16)
#define ISPOST_LCPGSZ_W_LENGTH                 (13)
#define ISPOST_LCPGSZ_W_DEFAULT                (0)
#define ISPOST_LCPGSZ_W_SIGNED_FIELD           (0)

/*
 * ISPOST, LCPGSZ, H
 * [12:0] H - Destination image width (pixel granularity).
 */
#define ISPOST_LCPGSZ_H_MASK                   (0x00001FFF)
#define ISPOST_LCPGSZ_H_LSBMASK                (0x00001FFF)
#define ISPOST_LCPGSZ_H_SHIFT                  (0)
#define ISPOST_LCPGSZ_H_LENGTH                 (13)
#define ISPOST_LCPGSZ_H_DEFAULT                (0)
#define ISPOST_LCPGSZ_H_SIGNED_FIELD           (0)


//----------------------------------------------------------
// LCOAY - LC Output Image Y Plane Start Address.
#define ISPOST_LCOAY_OFFSET                    (0x0040)
#define ISPOST_LCOAY                           (ISPOST_PERI_BASE_ADDR + ISPOST_LCOAY_OFFSET)

/*
 * ISPOST, LCOAY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_LCOAY_SAD_MASK                  (0xFFFFFFF8)
#define ISPOST_LCOAY_SAD_LSBMASK               (0xFFFFFFF8)
#define ISPOST_LCOAY_SAD_SHIFT                 (0)
#define ISPOST_LCOAY_SAD_LENGTH                (32)
#define ISPOST_LCOAY_SAD_DEFAULT               (0)
#define ISPOST_LCOAY_SAD_SIGNED_FIELD          (0)


//----------------------------------------------------------
// LCOAUV - LC Output Image UV Plane Start Address Register.
#define ISPOST_LCOAUV_OFFSET                   (0x0044)
#define ISPOST_LCOAUV                          (ISPOST_PERI_BASE_ADDR + ISPOST_LCOAUV_OFFSET)

/*
 * ISPOST, LCOAUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_LCOAUV_SAD_MASK                 (0xFFFFFFF8)
#define ISPOST_LCOAUV_SAD_LSBMASK              (0xFFFFFFF8)
#define ISPOST_LCOAUV_SAD_SHIFT                (0)
#define ISPOST_LCOAUV_SAD_LENGTH               (32)
#define ISPOST_LCOAUV_SAD_DEFAULT              (0)
#define ISPOST_LCOAUV_SAD_SIGNED_FIELD         (0)


//----------------------------------------------------------
// LCOS - LC Output Image Stride Register.
#define ISPOST_LCOS_OFFSET                     (0x0048)
#define ISPOST_LCOS                            (ISPOST_PERI_BASE_ADDR + ISPOST_LCOS_OFFSET)

