vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, LCOS, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_LCOS_SD_MASK                    (0x00001FF8)
#define ISPOST_LCOS_SD_LSBMASK                 (0x00001FF8)
#define ISPOST_LCOS_SD_SHIFT                   (0)
#define ISPOST_LCOS_SD_LENGTH                  (13)
#define ISPOST_LCOS_SD_DEFAULT                 (0)
#define ISPOST_LCOS_SD_SIGNED_FIELD            (0)


//----------------------------------------------------------
// LCLBGEOIDX - LC Line Buffer Line Geometry Index Register.
#define ISPOST_LCLBGEOIDX_OFFSET               (0x004C)
#define ISPOST_LCLBGEOIDX                      (ISPOST_PERI_BASE_ADDR + ISPOST_LCLBGEOIDX_OFFSET)

/*
 * ISPOST, LCLBGEOIDX, AINC
 * [12] AINC - Autoincrement enable.
 */
#define ISPOST_LCLBGEOIDX_AINC_MASK            (0x00001000)
#define ISPOST_LCLBGEOIDX_AINC_LSBMASK         (0x00000001)
#define ISPOST_LCLBGEOIDX_AINC_SHIFT           (12)
#define ISPOST_LCLBGEOIDX_AINC_LENGTH          (1)
#define ISPOST_LCLBGEOIDX_AINC_DEFAULT         (0)
#define ISPOST_LCLBGEOIDX_AINC_SIGNED_FIELD    (0)

/*
 * ISPOST, LCLBGEOIDX, IDX
 * [11:0] IDX - LCLBGEO index register.
 */
#define ISPOST_LCLBGEOIDX_IDX_MASK             (0x00000FFF)
#define ISPOST_LCLBGEOIDX_IDX_LSBMASK          (0x00000FFF)
#define ISPOST_LCLBGEOIDX_IDX_SHIFT            (0)
#define ISPOST_LCLBGEOIDX_IDX_LENGTH           (12)
#define ISPOST_LCLBGEOIDX_IDX_DEFAULT          (0)
#define ISPOST_LCLBGEOIDX_IDX_SIGNED_FIELD     (0)


//----------------------------------------------------------
// LCLBGEO - LC Line Buffer Line Geometry Register.
#define ISPOST_LCLBGEO_OFFSET                  (0x0050)
#define ISPOST_LCLBGEO                         (ISPOST_PERI_BASE_ADDR + ISPOST_LCLBGEO_OFFSET)

/*
 * ISPOST, LCLBGEO, LEND
 * [27:16] LEND - Line end.
 */
#define ISPOST_LCLBGEO_LEND_MASK               (0x0FFF0000)
#define ISPOST_LCLBGEO_LEND_LSBMASK            (0x00000FFF)
#define ISPOST_LCLBGEO_LEND_SHIFT              (16)
#define ISPOST_LCLBGEO_LEND_LENGTH             (12)
#define ISPOST_LCLBGEO_LEND_DEFAULT            (0)
#define ISPOST_LCLBGEO_LEND_SIGNED_FIELD       (0)

/*
 * ISPOST, LCLBGEO, LSTART
 * [11:0] LSTART - Line start.
 */
#define ISPOST_LCLBGEO_LSTART_MASK             (0x00000FFF)
#define ISPOST_LCLBGEO_LSTART_LSBMASK          (0x00000FFF)
#define ISPOST_LCLBGEO_LSTART_SHIFT            (0)
#define ISPOST_LCLBGEO_LSTART_LENGTH           (12)
#define ISPOST_LCLBGEO_LSTART_DEFAULT          (0)
#define ISPOST_LCLBGEO_LSTART_SIGNED_FIELD     (0)


//----------------------------------------------------------
// LCAXI - LC AXI Control Register.
#define ISPOST_LCAXI_OFFSET                    (0x005C)
#define ISPOST_LCAXI                           (ISPOST_PERI_BASE_ADDR + ISPOST_LCAXI_OFFSET)

/*
 * ISPOST, LCAXI, SRCRDL
 * [22:16] SRCRDL - Source Image AXI Read Request Limit.
 * Total number of QW requested by ISPOST for grid buffer by will be 64 - SRCRDL. Valid range: 56-4
 */
#define ISPOST_LCAXI_SRCRDL_MASK               (0x007F0000)
#define ISPOST_LCAXI_SRCRDL_LSBMASK            (0x0000007F)
#define ISPOST_LCAXI_SRCRDL_SHIFT              (16)
#define ISPOST_LCAXI_SRCRDL_LENGTH             (7)
#define ISPOST_LCAXI_SRCRDL_DEFAULT            (0)
#define ISPOST_LCAXI_SRCRDL_SIGNED_FIELD       (0)

/*
 * ISPOST, LCAXI, GBID
 * [15:8] GBID - Grid Buffer AXI Read ID.
 * (Please note: ALL AXI Read Ids must be unique).
 */
#define ISPOST_LCAXI_GBID_MASK                 (0x0000FF00)
#define ISPOST_LCAXI_GBID_LSBMASK              (0x000000FF)
#define ISPOST_LCAXI_GBID_SHIFT                (8)
#define ISPOST_LCAXI_GBID_LENGTH               (8)
#define ISPOST_LCAXI_GBID_DEFAULT              (0)
#define ISPOST_LCAXI_GBID_SIGNED_FIELD         (0)

/*
 * ISPOST, LCAXI, SRCID
 * [7:0] SRCID - Source Image AXI Read ID.
 * (Please note: ALL AXI Read Ids must be unique).
 */
#define ISPOST_LCAXI_SRCID_MASK                (0x000000FF)
#define ISPOST_LCAXI_SRCID_LSBMASK             (0x000000FF)
#define ISPOST_LCAXI_SRCID_SHIFT               (0)
#define ISPOST_LCAXI_SRCID_LENGTH              (8)
#define ISPOST_LCAXI_SRCID_DEFAULT             (0)
#define ISPOST_LCAXI_SRCID_SIGNED_FIELD        (0)



//==========================================================
// Overlay registers offset.
//----------------------------------------------------------
// OVM - OV Mode Register.
#define ISPOST_OVM_OFFSET                      (0x0060)
#define ISPOST_OVM                             (ISPOST_PERI_BASE_ADDR + ISPOST_OVM_OFFSET)

/*
 * ISPOST, OVM, ENOV7
 * [15] ENOV7 - Enable Overlay Layer 7.
 */
#define ISPOST_OVM_ENOV7_MASK                  (0x00008000)
#define ISPOST_OVM_ENOV7_LSBMASK               (0x00000001)
#define ISPOST_OVM_ENOV7_SHIFT                 (15)
#define ISPOST_OVM_ENOV7_LENGTH                (1)
#define ISPOST_OVM_ENOV7_DEFAULT               (0)
#define ISPOST_OVM_ENOV7_SIGNED_FIELD          (0)

/*
 * ISPOST, OVM, ENOV6
 * [14] ENOV6 - Enable Overlay Layer 6.
 */
#define ISPOST_OVM_ENOV6_MASK                  (0x00004000)
#define ISPOST_OVM_ENOV6_LSBMASK               (0x00000001)
#define ISPOST_OVM_ENOV6_SHIFT                 (14)
#define ISPOST_OVM_ENOV6_LENGTH                (1)
#define ISPOST_OVM_ENOV6_DEFAULT               (0)
#define ISPOST_OVM_ENOV6_SIGNED_FIELD          (0)

/*
 * ISPOST, OVM, ENOV5
 * [13] ENOV5 - Enable Overlay Layer 5.
 */
#define ISPOST_OVM_ENOV5_MASK                  (0x00002000)
#define ISPOST_OVM_ENOV5_LSBMASK               (0x00000001)
#define ISPOST_OVM_ENOV5_SHIFT                 (13)
#define ISPOST_OVM_ENOV5_LENGTH                (1)
#define ISPOST_OVM_ENOV5_DEFAULT               (0)
#define ISPOST_OVM_ENOV5_SIGNED_FIELD          (0)

/*
 * ISPOST, OVM, ENOV4
 * [12] ENOV4 - Enable Overlay Layer 4.
 */
#define ISPOST_OVM_ENOV4_MASK                  (0x00001000)
#define ISPOST_OVM_ENOV4_LSBMASK               (0x00000001)
#define ISPOST_OVM_ENOV4_SHIFT                 (12)
#define ISPOST_OVM_ENOV4_LENGTH                (1)
#define ISPOST_OVM_ENOV4_DEFAULT               (0)
#define ISPOST_OVM_ENOV4_SIGNED_FIELD          (0)

