vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, OVM, ENOV3
 * [11] ENOV3 - Enable Overlay Layer 3.
 */
#define ISPOST_OVM_ENOV3_MASK                  (0x00000800)
#define ISPOST_OVM_ENOV3_LSBMASK               (0x00000001)
#define ISPOST_OVM_ENOV3_SHIFT                 (11)
#define ISPOST_OVM_ENOV3_LENGTH                (1)
#define ISPOST_OVM_ENOV3_DEFAULT               (0)
#define ISPOST_OVM_ENOV3_SIGNED_FIELD          (0)

/*
 * ISPOST, OVM, ENOV2
 * [10] ENOV2 - Enable Overlay Layer 2.
 */
#define ISPOST_OVM_ENOV2_MASK                  (0x00000400)
#define ISPOST_OVM_ENOV2_LSBMASK               (0x00000001)
#define ISPOST_OVM_ENOV2_SHIFT                 (10)
#define ISPOST_OVM_ENOV2_LENGTH                (1)
#define ISPOST_OVM_ENOV2_DEFAULT               (0)
#define ISPOST_OVM_ENOV2_SIGNED_FIELD          (0)

/*
 * ISPOST, OVM, ENOV1
 * [9] ENOV1 - Enable Overlay Layer 1.
 */
#define ISPOST_OVM_ENOV1_MASK                  (0x00000200)
#define ISPOST_OVM_ENOV1_LSBMASK               (0x00000001)
#define ISPOST_OVM_ENOV1_SHIFT                 (9)
#define ISPOST_OVM_ENOV1_LENGTH                (1)
#define ISPOST_OVM_ENOV1_DEFAULT               (0)
#define ISPOST_OVM_ENOV1_SIGNED_FIELD          (0)

/*
 * ISPOST, OVM, ENOV0
 * [8] ENOV0 - Enable Overlay Layer 0.
 */
#define ISPOST_OVM_ENOV0_MASK                  (0x00000100)
#define ISPOST_OVM_ENOV0_LSBMASK               (0x00000001)
#define ISPOST_OVM_ENOV0_SHIFT                 (8)
#define ISPOST_OVM_ENOV0_LENGTH                (1)
#define ISPOST_OVM_ENOV0_DEFAULT               (0)
#define ISPOST_OVM_ENOV0_SIGNED_FIELD          (0)

/*
 * ISPOST, OVM, BCO
 * [4] BCO - Background color override.
 *           0 : Disabled.
 *               Color of pixels with overlay index =0 will be determined by overlay image.
 *           1 : Enabled.
 *               Color of pixels with overlay index =0 will be set by register OVBC (090H).
 */
#define ISPOST_OVM_BCO_MASK                    (0x00000010)
#define ISPOST_OVM_BCO_LSBMASK                 (0x00000001)
#define ISPOST_OVM_BCO_SHIFT                   (4)
#define ISPOST_OVM_BCO_LENGTH                  (1)
#define ISPOST_OVM_BCO_DEFAULT                 (0)
#define ISPOST_OVM_BCO_SIGNED_FIELD            (0)

/*
 * ISPOST, OVM, OVM
 * [1:0] OVM - Overlay mode.
 *             00 : UV.
 *             01 : Y.
 *             10 : YUV.
 *             11 : Reserved.
 */
#define ISPOST_OVM_OVM_MASK                    (0x00000003)
#define ISPOST_OVM_OVM_LSBMASK                 (0x00000003)
#define ISPOST_OVM_OVM_SHIFT                   (0)
#define ISPOST_OVM_OVM_LENGTH                  (2)
#define ISPOST_OVM_OVM_DEFAULT                 (0)
#define ISPOST_OVM_OVM_SIGNED_FIELD            (0)


//----------------------------------------------------------
// OVRIAY - OV Overlay Image Y Plane Start Address Register.
#define ISPOST_OVRIAY_OFFSET                   (0x0064)
#define ISPOST_OVRIAY                          (ISPOST_PERI_BASE_ADDR + ISPOST_OVRIAY_OFFSET)

/*
 * ISPOST, OVRIAY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 *              This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVRIAY_SAD_MASK                 (0xFFFFFFF8)
#define ISPOST_OVRIAY_SAD_LSBMASK              (0xFFFFFFF8)
#define ISPOST_OVRIAY_SAD_SHIFT                (0)
#define ISPOST_OVRIAY_SAD_LENGTH               (32)
#define ISPOST_OVRIAY_SAD_DEFAULT              (0)
#define ISPOST_OVRIAY_SAD_SIGNED_FIELD         (0)


//----------------------------------------------------------
// OVRIAUV - OV Overlay Image UV Plane Start Address Register.
#define ISPOST_OVRIAUV_OFFSET                  (0x0068)
#define ISPOST_OVRIAUV                         (ISPOST_PERI_BASE_ADDR + ISPOST_OVRIAUV_OFFSET)

/*
 * ISPOST, OVRIAUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_OVRIAUV_SAD_MASK                (0xFFFFFFF8)
#define ISPOST_OVRIAUV_SAD_LSBMASK             (0xFFFFFFF8)
#define ISPOST_OVRIAUV_SAD_SHIFT               (0)
#define ISPOST_OVRIAUV_SAD_LENGTH              (32)
#define ISPOST_OVRIAUV_SAD_DEFAULT             (0)
#define ISPOST_OVRIAUV_SAD_SIGNED_FIELD        (0)


//----------------------------------------------------------
// OVRIS - OV Overlay Image Stride Register.
#define ISPOST_OVRIS_OFFSET                    (0x006C)
#define ISPOST_OVRIS                           (ISPOST_PERI_BASE_ADDR + ISPOST_OVRIS_OFFSET)

/*
 * ISPOST, OVRIS, SD
 * [12:3] SD - Image stride (QWORD granularity).
 *             This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVRIS_SD_MASK                   (0x00001FF8)
#define ISPOST_OVRIS_SD_LSBMASK                (0x00001FF8)
#define ISPOST_OVRIS_SD_SHIFT                  (0)
#define ISPOST_OVRIS_SD_LENGTH                 (13)
#define ISPOST_OVRIS_SD_DEFAULT                (0)
#define ISPOST_OVRIS_SD_SIGNED_FIELD           (0)


//----------------------------------------------------------
// OVISZ - OV Overlay Image Size Register.
#define ISPOST_OVISZ_OFFSET                    (0x0070)
#define ISPOST_OVISZ                           (ISPOST_PERI_BASE_ADDR + ISPOST_OVISZ_OFFSET)

/*
 * ISPOST, OVISZ, W
 * [28:16] W - Overlay image width (pixel granularity).
 *             This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVISZ_W_MASK                    (0x1FFF0000)
#define ISPOST_OVISZ_W_LSBMASK                 (0x00001FFF)
#define ISPOST_OVISZ_W_SHIFT                   (16)
#define ISPOST_OVISZ_W_LENGTH                  (13)
#define ISPOST_OVISZ_W_DEFAULT                 (0)
#define ISPOST_OVISZ_W_SIGNED_FIELD            (0)

/*
 * ISPOST, OVISZ, H
 * [12:0] H - Overlay image height (line granularity).
 *            This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVISZ_H_MASK                    (0x00001FFF)
#define ISPOST_OVISZ_H_LSBMASK                 (0x00001FFF)
#define ISPOST_OVISZ_H_SHIFT                   (0)
#define ISPOST_OVISZ_H_LENGTH                  (13)
#define ISPOST_OVISZ_H_DEFAULT                 (0)
#define ISPOST_OVISZ_H_SIGNED_FIELD            (0)


//----------------------------------------------------------
// OVOFF - OV Overlay Offset Register.
#define ISPOST_OVOFF_OFFSET                    (0x0074)
#define ISPOST_OVOFF                           (ISPOST_PERI_BASE_ADDR + ISPOST_OVOFF_OFFSET)

