vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, OVOFF, X
 * [28:16] X - Overlay image horizontal offset (in relation to destination image).
 *             This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVOFF_X_MASK                    (0x1FFF0000)
#define ISPOST_OVOFF_X_LSBMASK                 (0x00001FFF)
#define ISPOST_OVOFF_X_SHIFT                   (16)
#define ISPOST_OVOFF_X_LENGTH                  (13)
#define ISPOST_OVOFF_X_DEFAULT                 (0)
#define ISPOST_OVOFF_X_SIGNED_FIELD            (0)

/*
 * ISPOST, OVOFF, Y
 * [12:0] Y - Overlay image vertical offset (in relation to destination image).
 *            This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVOFF_Y_MASK                    (0x00001FFF)
#define ISPOST_OVOFF_Y_LSBMASK                 (0x00001FFF)
#define ISPOST_OVOFF_Y_SHIFT                   (0)
#define ISPOST_OVOFF_Y_LENGTH                  (13)
#define ISPOST_OVOFF_Y_DEFAULT                 (0)
#define ISPOST_OVOFF_Y_SIGNED_FIELD            (0)


//----------------------------------------------------------
// OVALPHA0 - OV Overlay Alpha Value 0 Register.
#define ISPOST_OVALPHA0_OFFSET                 (0x0078)
#define ISPOST_OVALPHA0                        (ISPOST_PERI_BASE_ADDR + ISPOST_OVALPHA0_OFFSET)

/*
 * ISPOST, OVALPHA0, ALPHA3
 * [31:24] ALPHA3 - Overlay image alpha value register. (IDX=0)
 *                  Overlay image Color 0 Alpha value register. (IDX=1-7)
 *                  This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA0_ALPHA3_MASK            (0xFF000000)
#define ISPOST_OVALPHA0_ALPHA3_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA0_ALPHA3_SHIFT           (24)
#define ISPOST_OVALPHA0_ALPHA3_LENGTH          (8)
#define ISPOST_OVALPHA0_ALPHA3_DEFAULT         (0)
#define ISPOST_OVALPHA0_ALPHA3_SIGNED_FIELD    (0)

/*
 * ISPOST, OVALPHA0, ALPHA2
 * [23:16] ALPHA2 - Overlay image alpha value register. (IDX=0)
 *                  Overlay image Color 0 Y value register. (IDX=1-7)
 *                  This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA0_ALPHA2_MASK            (0x00FF0000)
#define ISPOST_OVALPHA0_ALPHA2_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA0_ALPHA2_SHIFT           (16)
#define ISPOST_OVALPHA0_ALPHA2_LENGTH          (8)
#define ISPOST_OVALPHA0_ALPHA2_DEFAULT         (0)
#define ISPOST_OVALPHA0_ALPHA2_SIGNED_FIELD    (0)

/*
 * ISPOST, OVALPHA0, ALPHA1
 * [15:8] ALPHA1 - Overlay image alpha value register. (IDX=0)
 *                 Overlay image Color 0 CB value register. (IDX=1-7)
 *                 This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA0_ALPHA1_MASK            (0x0000FF00)
#define ISPOST_OVALPHA0_ALPHA1_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA0_ALPHA1_SHIFT           (8)
#define ISPOST_OVALPHA0_ALPHA1_LENGTH          (8)
#define ISPOST_OVALPHA0_ALPHA1_DEFAULT         (0)
#define ISPOST_OVALPHA0_ALPHA1_SIGNED_FIELD    (0)

/*
 * ISPOST, OVALPHA0, ALPHA0
 * [7:0] ALPHA0 - Overlay image alpha value register. (IDX=0)
 *                Overlay image Color 0 CR value register. (IDX=1-7)
 *                This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA0_ALPHA0_MASK            (0x000000FF)
#define ISPOST_OVALPHA0_ALPHA0_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA0_ALPHA0_SHIFT           (0)
#define ISPOST_OVALPHA0_ALPHA0_LENGTH          (8)
#define ISPOST_OVALPHA0_ALPHA0_DEFAULT         (0)
#define ISPOST_OVALPHA0_ALPHA0_SIGNED_FIELD    (0)


//----------------------------------------------------------
// OVALPHA1 - OV Overlay Alpha Value 1 Register.
#define ISPOST_OVALPHA1_OFFSET                 (0x007C)
#define ISPOST_OVALPHA1                        (ISPOST_PERI_BASE_ADDR + ISPOST_OVALPHA1_OFFSET)

/*
 * ISPOST, OVALPHA1, ALPHA7
 * [31:24] ALPHA7 - Overlay image alpha value register. (IDX=0)
 *                  Overlay image Color 1 Alpha value register. (IDX=1-7)
 *                  This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA1_ALPHA7_MASK            (0xFF000000)
#define ISPOST_OVALPHA1_ALPHA7_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA1_ALPHA7_SHIFT           (24)
#define ISPOST_OVALPHA1_ALPHA7_LENGTH          (8)
#define ISPOST_OVALPHA1_ALPHA7_DEFAULT         (0)
#define ISPOST_OVALPHA1_ALPHA7_SIGNED_FIELD    (0)

/*
 * ISPOST, OVALPHA1, ALPHA6
 * [23:16] ALPHA6 - Overlay image alpha value register. (IDX=0)
 *                  Overlay image Color 1 Y value register. (IDX=1-7)
 *                  This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA1_ALPHA6_MASK            (0x00FF0000)
#define ISPOST_OVALPHA1_ALPHA6_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA1_ALPHA6_SHIFT           (16)
#define ISPOST_OVALPHA1_ALPHA6_LENGTH          (8)
#define ISPOST_OVALPHA1_ALPHA6_DEFAULT         (0)
#define ISPOST_OVALPHA1_ALPHA6_SIGNED_FIELD    (0)

/*
 * ISPOST, OVALPHA1, ALPHA5
 * [15:8] ALPHA5 - Overlay image alpha value register. (IDX=0)
 *                 Overlay image Color 1 CB value register. (IDX=1-7)
 *                 This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA1_ALPHA5_MASK            (0x0000FF00)
#define ISPOST_OVALPHA1_ALPHA5_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA1_ALPHA5_SHIFT           (8)
#define ISPOST_OVALPHA1_ALPHA5_LENGTH          (8)
#define ISPOST_OVALPHA1_ALPHA5_DEFAULT         (0)
#define ISPOST_OVALPHA1_ALPHA5_SIGNED_FIELD    (0)

/*
 * ISPOST, OVALPHA1, ALPHA4
 * [7:0] ALPHA4 - Overlay image alpha value register. (IDX=0)
 *                Overlay image Color 1 CR value register. (IDX=1-7)
 *                This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA1_ALPHA4_MASK            (0x000000FF)
#define ISPOST_OVALPHA1_ALPHA4_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA1_ALPHA4_SHIFT           (0)
#define ISPOST_OVALPHA1_ALPHA4_LENGTH          (8)
#define ISPOST_OVALPHA1_ALPHA4_DEFAULT         (0)
#define ISPOST_OVALPHA1_ALPHA4_SIGNED_FIELD    (0)


//----------------------------------------------------------
// OVALPHA2 - OV Overlay Alpha Value 2 Register.
#define ISPOST_OVALPHA2_OFFSET                 (0x0080)
#define ISPOST_OVALPHA2                        (ISPOST_PERI_BASE_ADDR + ISPOST_OVALPHA2_OFFSET)

