vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, OVALPHA2, ALPHA11
 * [31:24] ALPHA11 - Overlay image alpha value register. (IDX=0)
 *                   Overlay image Color 2 Alpha value register. (IDX=1-7)
 *                   This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA2_ALPHA11_MASK           (0xFF000000)
#define ISPOST_OVALPHA2_ALPHA11_LSBMASK        (0x000000FF)
#define ISPOST_OVALPHA2_ALPHA11_SHIFT          (24)
#define ISPOST_OVALPHA2_ALPHA11_LENGTH         (8)
#define ISPOST_OVALPHA2_ALPHA11_DEFAULT        (0)
#define ISPOST_OVALPHA2_ALPHA11_SIGNED_FIELD   (0)

/*
 * ISPOST, OVALPHA2, ALPHA10
 * [23:16] ALPHA10 - Overlay image alpha value register. (IDX=0)
 *                   Overlay image Color 2 Y value register. (IDX=1-7)
 *                   This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA2_ALPHA10_MASK           (0x00FF0000)
#define ISPOST_OVALPHA2_ALPHA10_LSBMASK        (0x000000FF)
#define ISPOST_OVALPHA2_ALPHA10_SHIFT          (16)
#define ISPOST_OVALPHA2_ALPHA10_LENGTH         (8)
#define ISPOST_OVALPHA2_ALPHA10_DEFAULT        (0)
#define ISPOST_OVALPHA2_ALPHA10_SIGNED_FIELD   (0)

/*
 * ISPOST, OVALPHA2, ALPHA9
 * [15:8] ALPHA9 - Overlay image alpha value register. (IDX=0)
 *                 Overlay image Color 2 CB value register. (IDX=1-7)
 *                 This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA2_ALPHA9_MASK            (0x0000FF00)
#define ISPOST_OVALPHA2_ALPHA9_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA2_ALPHA9_SHIFT           (8)
#define ISPOST_OVALPHA2_ALPHA9_LENGTH          (8)
#define ISPOST_OVALPHA2_ALPHA9_DEFAULT         (0)
#define ISPOST_OVALPHA2_ALPHA9_SIGNED_FIELD    (0)

/*
 * ISPOST, OVALPHA2, ALPHA8
 * [7:0] ALPHA8 - Overlay image alpha value register. (IDX=0)
 *                Overlay image Color 2 CR value register. (IDX=1-7)
 *                This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA2_ALPHA8_MASK            (0x000000FF)
#define ISPOST_OVALPHA2_ALPHA8_LSBMASK         (0x000000FF)
#define ISPOST_OVALPHA2_ALPHA8_SHIFT           (0)
#define ISPOST_OVALPHA2_ALPHA8_LENGTH          (8)
#define ISPOST_OVALPHA2_ALPHA8_DEFAULT         (0)
#define ISPOST_OVALPHA2_ALPHA8_SIGNED_FIELD    (0)


//----------------------------------------------------------
// OVALPHA3 - OV Overlay Alpha Value 3 Register.
#define ISPOST_OVALPHA3_OFFSET                 (0x0084)
#define ISPOST_OVALPHA3                        (ISPOST_PERI_BASE_ADDR + ISPOST_OVALPHA3_OFFSET)

/*
 * ISPOST, OVALPHA3, ALPHA15
 * [31:24] ALPHA15 - Overlay image alpha value register. (IDX=0)
 *                   Overlay image Color 3 Alpha value register. (IDX=1-7)
 *                   This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA3_ALPHA15_MASK           (0xFF000000)
#define ISPOST_OVALPHA3_ALPHA15_LSBMASK        (0x000000FF)
#define ISPOST_OVALPHA3_ALPHA15_SHIFT          (24)
#define ISPOST_OVALPHA3_ALPHA15_LENGTH         (8)
#define ISPOST_OVALPHA3_ALPHA15_DEFAULT        (0)
#define ISPOST_OVALPHA3_ALPHA15_SIGNED_FIELD   (0)

/*
 * ISPOST, OVALPHA3, ALPHA14
 * [23:16] ALPHA14 - Overlay image alpha value register. (IDX=0)
 *                   Overlay image Color 3 Y value register. (IDX=1-7)
 *                   This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA3_ALPHA14_MASK           (0x00FF0000)
#define ISPOST_OVALPHA3_ALPHA14_LSBMASK        (0x000000FF)
#define ISPOST_OVALPHA3_ALPHA14_SHIFT          (16)
#define ISPOST_OVALPHA3_ALPHA14_LENGTH         (8)
#define ISPOST_OVALPHA3_ALPHA14_DEFAULT        (0)
#define ISPOST_OVALPHA3_ALPHA14_SIGNED_FIELD   (0)

/*
 * ISPOST, OVALPHA3, ALPHA13
 * [15:8] ALPHA13 - Overlay image alpha value register. (IDX=0)
 *                  Overlay image Color 3 CB value register. (IDX=1-7)
 *                  This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA3_ALPHA13_MASK           (0x0000FF00)
#define ISPOST_OVALPHA3_ALPHA13_LSBMASK        (0x000000FF)
#define ISPOST_OVALPHA3_ALPHA13_SHIFT          (8)
#define ISPOST_OVALPHA3_ALPHA13_LENGTH         (8)
#define ISPOST_OVALPHA3_ALPHA13_DEFAULT        (0)
#define ISPOST_OVALPHA3_ALPHA13_SIGNED_FIELD   (0)

/*
 * ISPOST, OVALPHA3, ALPHA12
 * [7:0] ALPHA12 - Overlay image alpha value register. (IDX=0)
 *                 Overlay image Color 3 CR value register. (IDX=1-7)
 *                 This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 */
#define ISPOST_OVALPHA3_ALPHA12_MASK           (0x000000FF)
#define ISPOST_OVALPHA3_ALPHA12_LSBMASK        (0x000000FF)
#define ISPOST_OVALPHA3_ALPHA12_SHIFT          (0)
#define ISPOST_OVALPHA3_ALPHA12_LENGTH         (8)
#define ISPOST_OVALPHA3_ALPHA12_DEFAULT        (0)
#define ISPOST_OVALPHA3_ALPHA12_SIGNED_FIELD   (0)


//----------------------------------------------------------
// OVAXI - OV AXI Control Register.
#define ISPOST_OVAXI_OFFSET                    (0x0088)
#define ISPOST_OVAXI                           (ISPOST_PERI_BASE_ADDR + ISPOST_OVAXI_OFFSET)

/*
 * ISPOST, OVAXI, OVID
 * [7:0] OVID - OV Image AXI Read ID.
 *              This register is indexed by OVIDX[IDX] (08CH). Valid index values: 0-7.
 * (Please note: ALL AXI Read Ids must be unique).
 */
#define ISPOST_OVAXI_OVID_MASK                 (0x000000FF)
#define ISPOST_OVAXI_OVID_LSBMASK              (0x000000FF)
#define ISPOST_OVAXI_OVID_SHIFT                (0)
#define ISPOST_OVAXI_OVID_LENGTH               (8)
#define ISPOST_OVAXI_OVID_DEFAULT              (0)
#define ISPOST_OVAXI_OVID_SIGNED_FIELD         (0)


//----------------------------------------------------------
// OVIDX - OV Index Register.
#define ISPOST_OVIDX_OFFSET                    (0x008C)
#define ISPOST_OVIDX                           (ISPOST_PERI_BASE_ADDR + ISPOST_OVIDX_OFFSET)

/*
 * ISPOST, OVIDX, IDX
 * [2:0] IDX - OV Index.
 */
#define ISPOST_OVIDX_IDX_MASK                  (0x00000007)
#define ISPOST_OVIDX_IDX_LSBMASK               (0x00000007)
#define ISPOST_OVIDX_IDX_SHIFT                 (0)
#define ISPOST_OVIDX_IDX_LENGTH                (3)
#define ISPOST_OVIDX_IDX_DEFAULT               (0)
#define ISPOST_OVIDX_IDX_SIGNED_FIELD          (0)


//----------------------------------------------------------
// OVBC - OV Overlay Background Color Register.
#define ISPOST_OVBC_OFFSET                     (0x0090)
#define ISPOST_OVBC                            (ISPOST_PERI_BASE_ADDR + ISPOST_OVBC_OFFSET)

