vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, OVBC, Y
 * [23:16] Y - Backgound Y component value. (0-255).
 */
#define ISPOST_OVBC_Y_MASK                     (0x00FF0000)
#define ISPOST_OVBC_Y_LSBMASK                  (0x000000FF)
#define ISPOST_OVBC_Y_SHIFT                    (16)
#define ISPOST_OVBC_Y_LENGTH                   (8)
#define ISPOST_OVBC_Y_DEFAULT                  (0)
#define ISPOST_OVBC_Y_SIGNED_FIELD             (0)

/*
 * ISPOST, OVBC, CB
 * [15:8] CB - Backgound CB component value. (0-255).
 */
#define ISPOST_OVBC_CB_MASK                    (0x0000FF00)
#define ISPOST_OVBC_CB_LSBMASK                 (0x000000FF)
#define ISPOST_OVBC_CB_SHIFT                   (8)
#define ISPOST_OVBC_CB_LENGTH                  (8)
#define ISPOST_OVBC_CB_DEFAULT                 (0)
#define ISPOST_OVBC_CB_SIGNED_FIELD            (0)

/*
 * ISPOST, OVBC, CR
 * [7:0] CR - Backgound CR component value. (0-255).
 */
#define ISPOST_OVBC_CR_MASK                    (0x000000FF)
#define ISPOST_OVBC_CR_LSBMASK                 (0x000000FF)
#define ISPOST_OVBC_CR_SHIFT                   (0)
#define ISPOST_OVBC_CR_LENGTH                  (8)
#define ISPOST_OVBC_CR_DEFAULT                 (0)
#define ISPOST_OVBC_CR_SIGNED_FIELD            (0)



//==========================================================
// Unscaled output interface registers offset.
//----------------------------------------------------------
// UOAY - Unscaled Output Image Y Plane Start Address Register.
#define ISPOST_UOAY_OFFSET                     (0x00AC)
#define ISPOST_UOAY                            (ISPOST_PERI_BASE_ADDR + ISPOST_UOAY_OFFSET)

/*
 * ISPOST, UOAY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_UOAY_SAD_MASK                   (0xFFFFFFF8)
#define ISPOST_UOAY_SAD_LSBMASK                (0xFFFFFFF8)
#define ISPOST_UOAY_SAD_SHIFT                  (0)
#define ISPOST_UOAY_SAD_LENGTH                 (32)
#define ISPOST_UOAY_SAD_DEFAULT                (0)
#define ISPOST_UOAY_SAD_SIGNED_FIELD           (0)


//----------------------------------------------------------
// UOAUV - Unscaled Output Image UV Plane Start Address Register.
#define ISPOST_UOAUV_OFFSET                    (0x00B0)
#define ISPOST_UOAUV                           (ISPOST_PERI_BASE_ADDR + ISPOST_UOAUV_OFFSET)

/*
 * ISPOST, UOAUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_UOAUV_SAD_MASK                  (0xFFFFFFF8)
#define ISPOST_UOAUV_SAD_LSBMASK               (0xFFFFFFF8)
#define ISPOST_UOAUV_SAD_SHIFT                 (0)
#define ISPOST_UOAUV_SAD_LENGTH                (32)
#define ISPOST_UOAUV_SAD_DEFAULT               (0)
#define ISPOST_UOAUV_SAD_SIGNED_FIELD          (0)


//----------------------------------------------------------
// UOS - Unscaled Output Image Stride Register.
#define ISPOST_UOS_OFFSET                      (0x00B4)
#define ISPOST_UOS                             (ISPOST_PERI_BASE_ADDR + ISPOST_UOS_OFFSET)

/*
 * ISPOST, UOS, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_UOS_SD_MASK                     (0x00001FF8)
#define ISPOST_UOS_SD_LSBMASK                  (0x00001FF8)
#define ISPOST_UOS_SD_SHIFT                    (0)
#define ISPOST_UOS_SD_LENGTH                   (13)
#define ISPOST_UOS_SD_DEFAULT                  (0)
#define ISPOST_UOS_SD_SIGNED_FIELD             (0)


//----------------------------------------------------------
// UOPGM - Unscaled Output Pixel Coordinate Generator Mode Register.
#define ISPOST_UOPGM_OFFSET                    (0x0270)
#define ISPOST_UOPGM                           (ISPOST_PERI_BASE_ADDR + ISPOST_UOPGM_OFFSET)

/*
 * ISPOST, UOPGM, SCANH
 * [5:4] SCANH - scan height.
 *               00 : 8.
 *               10 : 16.
 *               01 : 32.
 *               11 : 2.
 *               NOTE: only scan height 16 is compatible with direct link to video codec
 */
#define ISPOST_UOPGM_SCANH_MASK                (0x00000030)
#define ISPOST_UOPGM_SCANH_LSBMASK             (0x00000003)
#define ISPOST_UOPGM_SCANH_SHIFT               (4)
#define ISPOST_UOPGM_SCANH_LENGTH              (2)
#define ISPOST_UOPGM_SCANH_DEFAULT             (0)
#define ISPOST_UOPGM_SCANH_SIGNED_FIELD        (0)


//----------------------------------------------------------
// UOAXI - Unscaled Output AXI Control Register.
#define ISPOST_UOAXI_OFFSET                    (0x0274)
#define ISPOST_UOAXI                           (ISPOST_PERI_BASE_ADDR + ISPOST_UOAXI_OFFSET)

/*
 * ISPOST, UOAXI, REFWID
 * [15:8] REFWID - Reference Image AXI Write ID.
 */
#define ISPOST_UOAXI_REFWID_MASK               (0x0000FF00)
#define ISPOST_UOAXI_REFWID_LSBMASK            (0x000000FF)
#define ISPOST_UOAXI_REFWID_SHIFT              (8)
#define ISPOST_UOAXI_REFWID_LENGTH             (8)
#define ISPOST_UOAXI_REFWID_DEFAULT            (0)
#define ISPOST_UOAXI_REFWID_SIGNED_FIELD       (0)



//==========================================================
// 3D Denoise registers offset.
//----------------------------------------------------------
// DNRIAY - DN Reference Input Image Y Plane Start Address Register.
#define ISPOST_DNRIAY_OFFSET                   (0x00A0)
#define ISPOST_DNRIAY                          (ISPOST_PERI_BASE_ADDR + ISPOST_DNRIAY_OFFSET)

/*
 * ISPOST, DNRIAY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_DNRIAY_SAD_MASK                 (0xFFFFFFF8)
#define ISPOST_DNRIAY_SAD_LSBMASK              (0xFFFFFFF8)
#define ISPOST_DNRIAY_SAD_SHIFT                (0)
#define ISPOST_DNRIAY_SAD_LENGTH               (32)
#define ISPOST_DNRIAY_SAD_DEFAULT              (0)
#define ISPOST_DNRIAY_SAD_SIGNED_FIELD         (0)


//----------------------------------------------------------
// DNRIAUV - DN Reference Input Image UV Plane Start Address Register.
#define ISPOST_DNRIAUV_OFFSET                  (0x00A4)
#define ISPOST_DNRIAUV                         (ISPOST_PERI_BASE_ADDR + ISPOST_DNRIAUV_OFFSET)

/*
 * ISPOST, DNRIAUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_DNRIAUV_SAD_MASK                (0xFFFFFFF8)
#define ISPOST_DNRIAUV_SAD_LSBMASK             (0xFFFFFFF8)
#define ISPOST_DNRIAUV_SAD_SHIFT               (0)
#define ISPOST_DNRIAUV_SAD_LENGTH              (32)
#define ISPOST_DNRIAUV_SAD_DEFAULT             (0)
#define ISPOST_DNRIAUV_SAD_SIGNED_FIELD        (0)


//----------------------------------------------------------
// DNRIS - DN Reference Input Image Stride Register.
#define ISPOST_DNRIS_OFFSET                    (0x00A8)
#define ISPOST_DNRIS                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNRIS_OFFSET)

