vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, DNRIS, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_DNRIS_SD_MASK                   (0x00001FF8)
#define ISPOST_DNRIS_SD_LSBMASK                (0x00001FF8)
#define ISPOST_DNRIS_SD_SHIFT                  (0)
#define ISPOST_DNRIS_SD_LENGTH                 (13)
#define ISPOST_DNRIS_SD_DEFAULT                (0)
#define ISPOST_DNRIS_SD_SIGNED_FIELD           (0)


//----------------------------------------------------------
// DNROAY - DN Reference Output Image Y Plane Start Address Register.
#define ISPOST_DNROAY_OFFSET                   (0x0280)
#define ISPOST_DNROAY                          (ISPOST_PERI_BASE_ADDR + ISPOST_DNROAY_OFFSET)

/*
 * ISPOST, DNROAY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_DNROAY_SAD_MASK                 (0xFFFFFFF8)
#define ISPOST_DNROAY_SAD_LSBMASK              (0xFFFFFFF8)
#define ISPOST_DNROAY_SAD_SHIFT                (0)
#define ISPOST_DNROAY_SAD_LENGTH               (32)
#define ISPOST_DNROAY_SAD_DEFAULT              (0)
#define ISPOST_DNROAY_SAD_SIGNED_FIELD         (0)


//----------------------------------------------------------
// DNROAUV - DN Reference Output Image UV Plane Start Address Register.
#define ISPOST_DNROAUV_OFFSET                  (0x0284)
#define ISPOST_DNROAUV                         (ISPOST_PERI_BASE_ADDR + ISPOST_DNROAUV_OFFSET)

/*
 * ISPOST, DNROAUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_DNROAUV_SAD_MASK                (0xFFFFFFF8)
#define ISPOST_DNROAUV_SAD_LSBMASK             (0xFFFFFFF8)
#define ISPOST_DNROAUV_SAD_SHIFT               (0)
#define ISPOST_DNROAUV_SAD_LENGTH              (32)
#define ISPOST_DNROAUV_SAD_DEFAULT             (0)
#define ISPOST_DNROAUV_SAD_SIGNED_FIELD        (0)


//----------------------------------------------------------
// DNROS - DN Reference Output Image Stride Register.
#define ISPOST_DNROS_OFFSET                    (0x0288)
#define ISPOST_DNROS                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNROS_OFFSET)

/*
 * ISPOST, DNROS, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_DNROS_SD_MASK                   (0x00001FF8)
#define ISPOST_DNROS_SD_LSBMASK                (0x00001FF8)
#define ISPOST_DNROS_SD_SHIFT                  (0)
#define ISPOST_DNROS_SD_LENGTH                 (13)
#define ISPOST_DNROS_SD_DEFAULT                (0)
#define ISPOST_DNROS_SD_SIGNED_FIELD           (0)


//----------------------------------------------------------
// DNMC0 - DN Mask Curve 0 Register.
#define ISPOST_DNMC0_OFFSET                    (0x00B8)
#define ISPOST_DNMC0                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC0_OFFSET)

/*
 * ISPOST, DNMC0, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC0_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC0_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC0_S_SHIFT                   (20)
#define ISPOST_DNMC0_S_LENGTH                  (12)
#define ISPOST_DNMC0_S_DEFAULT                 (0)
#define ISPOST_DNMC0_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC0, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC0_R_MASK                    (0x00070000)
#define ISPOST_DNMC0_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC0_R_SHIFT                   (16)
#define ISPOST_DNMC0_R_LENGTH                  (3)
#define ISPOST_DNMC0_R_DEFAULT                 (0)
#define ISPOST_DNMC0_R_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC0, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC0_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC0_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC0_Y_SHIFT                   (8)
#define ISPOST_DNMC0_Y_LENGTH                  (8)
#define ISPOST_DNMC0_Y_DEFAULT                 (0)
#define ISPOST_DNMC0_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC0, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC0_X_MASK                    (0x000000FF)
#define ISPOST_DNMC0_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC0_X_SHIFT                   (0)
#define ISPOST_DNMC0_X_LENGTH                  (8)
#define ISPOST_DNMC0_X_DEFAULT                 (0)
#define ISPOST_DNMC0_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC1 - DN Mask Curve 1 Register.
#define ISPOST_DNMC1_OFFSET                    (0x00BC)
#define ISPOST_DNMC1                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC1_OFFSET)

/*
 * ISPOST, DNMC1, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC1_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC1_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC1_S_SHIFT                   (20)
#define ISPOST_DNMC1_S_LENGTH                  (12)
#define ISPOST_DNMC1_S_DEFAULT                 (0)
#define ISPOST_DNMC1_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC1, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC1_R_MASK                    (0x00070000)
#define ISPOST_DNMC1_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC1_R_SHIFT                   (16)
#define ISPOST_DNMC1_R_LENGTH                  (3)
#define ISPOST_DNMC1_R_DEFAULT                 (0)
#define ISPOST_DNMC1_R_SIGNED_FIELD            (0)

