vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, DNMC1, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC1_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC1_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC1_Y_SHIFT                   (8)
#define ISPOST_DNMC1_Y_LENGTH                  (8)
#define ISPOST_DNMC1_Y_DEFAULT                 (0)
#define ISPOST_DNMC1_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC1, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC1_X_MASK                    (0x000000FF)
#define ISPOST_DNMC1_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC1_X_SHIFT                   (0)
#define ISPOST_DNMC1_X_LENGTH                  (8)
#define ISPOST_DNMC1_X_DEFAULT                 (0)
#define ISPOST_DNMC1_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC2 - DN Mask Curve 2 Register.
#define ISPOST_DNMC2_OFFSET                    (0x00C0)
#define ISPOST_DNMC2                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC2_OFFSET)

/*
 * ISPOST, DNMC2, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC2_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC2_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC2_S_SHIFT                   (20)
#define ISPOST_DNMC2_S_LENGTH                  (12)
#define ISPOST_DNMC2_S_DEFAULT                 (0)
#define ISPOST_DNMC2_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC2, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC2_R_MASK                    (0x00070000)
#define ISPOST_DNMC2_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC2_R_SHIFT                   (16)
#define ISPOST_DNMC2_R_LENGTH                  (3)
#define ISPOST_DNMC2_R_DEFAULT                 (0)
#define ISPOST_DNMC2_R_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC2, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC2_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC2_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC2_Y_SHIFT                   (8)
#define ISPOST_DNMC2_Y_LENGTH                  (8)
#define ISPOST_DNMC2_Y_DEFAULT                 (0)
#define ISPOST_DNMC2_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC2, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC2_X_MASK                    (0x000000FF)
#define ISPOST_DNMC2_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC2_X_SHIFT                   (0)
#define ISPOST_DNMC2_X_LENGTH                  (8)
#define ISPOST_DNMC2_X_DEFAULT                 (0)
#define ISPOST_DNMC2_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC3 - DN Mask Curve 3 Register.
#define ISPOST_DNMC3_OFFSET                    (0x00C4)
#define ISPOST_DNMC3                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC3_OFFSET)

/*
 * ISPOST, DNMC3, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC3_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC3_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC3_S_SHIFT                   (20)
#define ISPOST_DNMC3_S_LENGTH                  (12)
#define ISPOST_DNMC3_S_DEFAULT                 (0)
#define ISPOST_DNMC3_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC3, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC3_R_MASK                    (0x00070000)
#define ISPOST_DNMC3_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC3_R_SHIFT                   (16)
#define ISPOST_DNMC3_R_LENGTH                  (3)
#define ISPOST_DNMC3_R_DEFAULT                 (0)
#define ISPOST_DNMC3_R_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC3, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC3_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC3_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC3_Y_SHIFT                   (8)
#define ISPOST_DNMC3_Y_LENGTH                  (8)
#define ISPOST_DNMC3_Y_DEFAULT                 (0)
#define ISPOST_DNMC3_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC3, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC3_X_MASK                    (0x000000FF)
#define ISPOST_DNMC3_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC3_X_SHIFT                   (0)
#define ISPOST_DNMC3_X_LENGTH                  (8)
#define ISPOST_DNMC3_X_DEFAULT                 (0)
#define ISPOST_DNMC3_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC4 - DN Mask Curve 4 Register.
#define ISPOST_DNMC4_OFFSET                    (0x00C8)
#define ISPOST_DNMC4                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC4_OFFSET)

