vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, DNMC4, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC4_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC4_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC4_S_SHIFT                   (20)
#define ISPOST_DNMC4_S_LENGTH                  (12)
#define ISPOST_DNMC4_S_DEFAULT                 (0)
#define ISPOST_DNMC4_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC4, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC4_R_MASK                    (0x00070000)
#define ISPOST_DNMC4_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC4_R_SHIFT                   (16)
#define ISPOST_DNMC4_R_LENGTH                  (3)
#define ISPOST_DNMC4_R_DEFAULT                 (0)
#define ISPOST_DNMC4_R_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC4, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC4_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC4_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC4_Y_SHIFT                   (8)
#define ISPOST_DNMC4_Y_LENGTH                  (8)
#define ISPOST_DNMC4_Y_DEFAULT                 (0)
#define ISPOST_DNMC4_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC4, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC4_X_MASK                    (0x000000FF)
#define ISPOST_DNMC4_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC4_X_SHIFT                   (0)
#define ISPOST_DNMC4_X_LENGTH                  (8)
#define ISPOST_DNMC4_X_DEFAULT                 (0)
#define ISPOST_DNMC4_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC5 - DN Mask Curve 5 Register.
#define ISPOST_DNMC5_OFFSET                    (0x00CC)
#define ISPOST_DNMC5                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC5_OFFSET)

/*
 * ISPOST, DNMC5, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC5_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC5_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC5_S_SHIFT                   (20)
#define ISPOST_DNMC5_S_LENGTH                  (12)
#define ISPOST_DNMC5_S_DEFAULT                 (0)
#define ISPOST_DNMC5_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC5, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC5_R_MASK                    (0x00070000)
#define ISPOST_DNMC5_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC5_R_SHIFT                   (16)
#define ISPOST_DNMC5_R_LENGTH                  (3)
#define ISPOST_DNMC5_R_DEFAULT                 (0)
#define ISPOST_DNMC5_R_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC5, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC5_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC5_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC5_Y_SHIFT                   (8)
#define ISPOST_DNMC5_Y_LENGTH                  (8)
#define ISPOST_DNMC5_Y_DEFAULT                 (0)
#define ISPOST_DNMC5_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC5, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC5_X_MASK                    (0x000000FF)
#define ISPOST_DNMC5_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC5_X_SHIFT                   (0)
#define ISPOST_DNMC5_X_LENGTH                  (8)
#define ISPOST_DNMC5_X_DEFAULT                 (0)
#define ISPOST_DNMC5_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC6 - DN Mask Curve 6 Register.
#define ISPOST_DNMC6_OFFSET                    (0x00D0)
#define ISPOST_DNMC6                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC6_OFFSET)

/*
 * ISPOST, DNMC6, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC6_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC6_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC6_S_SHIFT                   (20)
#define ISPOST_DNMC6_S_LENGTH                  (12)
#define ISPOST_DNMC6_S_DEFAULT                 (0)
#define ISPOST_DNMC6_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC6, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC6_R_MASK                    (0x00070000)
#define ISPOST_DNMC6_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC6_R_SHIFT                   (16)
#define ISPOST_DNMC6_R_LENGTH                  (3)
#define ISPOST_DNMC6_R_DEFAULT                 (0)
#define ISPOST_DNMC6_R_SIGNED_FIELD            (0)

