vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, DNMC6, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC6_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC6_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC6_Y_SHIFT                   (8)
#define ISPOST_DNMC6_Y_LENGTH                  (8)
#define ISPOST_DNMC6_Y_DEFAULT                 (0)
#define ISPOST_DNMC6_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC6, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC6_X_MASK                    (0x000000FF)
#define ISPOST_DNMC6_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC6_X_SHIFT                   (0)
#define ISPOST_DNMC6_X_LENGTH                  (8)
#define ISPOST_DNMC6_X_DEFAULT                 (0)
#define ISPOST_DNMC6_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC7 - DN Mask Curve 7 Register.
#define ISPOST_DNMC7_OFFSET                    (0x00D4)
#define ISPOST_DNMC7                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC7_OFFSET)

/*
 * ISPOST, DNMC7, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC7_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC7_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC7_S_SHIFT                   (20)
#define ISPOST_DNMC7_S_LENGTH                  (12)
#define ISPOST_DNMC7_S_DEFAULT                 (0)
#define ISPOST_DNMC7_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC7, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC7_R_MASK                    (0x00070000)
#define ISPOST_DNMC7_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC7_R_SHIFT                   (16)
#define ISPOST_DNMC7_R_LENGTH                  (3)
#define ISPOST_DNMC7_R_DEFAULT                 (0)
#define ISPOST_DNMC7_R_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC7, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC7_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC7_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC7_Y_SHIFT                   (8)
#define ISPOST_DNMC7_Y_LENGTH                  (8)
#define ISPOST_DNMC7_Y_DEFAULT                 (0)
#define ISPOST_DNMC7_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC7, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC7_X_MASK                    (0x000000FF)
#define ISPOST_DNMC7_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC7_X_SHIFT                   (0)
#define ISPOST_DNMC7_X_LENGTH                  (8)
#define ISPOST_DNMC7_X_DEFAULT                 (0)
#define ISPOST_DNMC7_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC8 - DN Mask Curve 8 Register.
#define ISPOST_DNMC8_OFFSET                    (0x00D8)
#define ISPOST_DNMC8                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC8_OFFSET)

/*
 * ISPOST, DNMC8, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC8_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC8_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC8_S_SHIFT                   (20)
#define ISPOST_DNMC8_S_LENGTH                  (12)
#define ISPOST_DNMC8_S_DEFAULT                 (0)
#define ISPOST_DNMC8_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC8, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC8_R_MASK                    (0x00070000)
#define ISPOST_DNMC8_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC8_R_SHIFT                   (16)
#define ISPOST_DNMC8_R_LENGTH                  (3)
#define ISPOST_DNMC8_R_DEFAULT                 (0)
#define ISPOST_DNMC8_R_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC8, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC8_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC8_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC8_Y_SHIFT                   (8)
#define ISPOST_DNMC8_Y_LENGTH                  (8)
#define ISPOST_DNMC8_Y_DEFAULT                 (0)
#define ISPOST_DNMC8_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC8, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC8_X_MASK                    (0x000000FF)
#define ISPOST_DNMC8_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC8_X_SHIFT                   (0)
#define ISPOST_DNMC8_X_LENGTH                  (8)
#define ISPOST_DNMC8_X_DEFAULT                 (0)
#define ISPOST_DNMC8_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC9 - DN Mask Curve 9 Register.
#define ISPOST_DNMC9_OFFSET                    (0x00DC)
#define ISPOST_DNMC9                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC9_OFFSET)

