vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, DNMC9, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC9_S_MASK                    (0xFFF00000)
#define ISPOST_DNMC9_S_LSBMASK                 (0x00000FFF)
#define ISPOST_DNMC9_S_SHIFT                   (20)
#define ISPOST_DNMC9_S_LENGTH                  (12)
#define ISPOST_DNMC9_S_DEFAULT                 (0)
#define ISPOST_DNMC9_S_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC9, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC9_R_MASK                    (0x00070000)
#define ISPOST_DNMC9_R_LSBMASK                 (0x00000007)
#define ISPOST_DNMC9_R_SHIFT                   (16)
#define ISPOST_DNMC9_R_LENGTH                  (3)
#define ISPOST_DNMC9_R_DEFAULT                 (0)
#define ISPOST_DNMC9_R_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC9, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC9_Y_MASK                    (0x0000FF00)
#define ISPOST_DNMC9_Y_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC9_Y_SHIFT                   (8)
#define ISPOST_DNMC9_Y_LENGTH                  (8)
#define ISPOST_DNMC9_Y_DEFAULT                 (0)
#define ISPOST_DNMC9_Y_SIGNED_FIELD            (0)

/*
 * ISPOST, DNMC9, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC9_X_MASK                    (0x000000FF)
#define ISPOST_DNMC9_X_LSBMASK                 (0x000000FF)
#define ISPOST_DNMC9_X_SHIFT                   (0)
#define ISPOST_DNMC9_X_LENGTH                  (8)
#define ISPOST_DNMC9_X_DEFAULT                 (0)
#define ISPOST_DNMC9_X_SIGNED_FIELD            (0)


//----------------------------------------------------------
// DNMC10 - DN Mask Curve 10 Register.
#define ISPOST_DNMC10_OFFSET                   (0x00E0)
#define ISPOST_DNMC10                          (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC10_OFFSET)

/*
 * ISPOST, DNMC10, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC10_S_MASK                   (0xFFF00000)
#define ISPOST_DNMC10_S_LSBMASK                (0x00000FFF)
#define ISPOST_DNMC10_S_SHIFT                  (20)
#define ISPOST_DNMC10_S_LENGTH                 (12)
#define ISPOST_DNMC10_S_DEFAULT                (0)
#define ISPOST_DNMC10_S_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC10, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC10_R_MASK                   (0x00070000)
#define ISPOST_DNMC10_R_LSBMASK                (0x00000007)
#define ISPOST_DNMC10_R_SHIFT                  (16)
#define ISPOST_DNMC10_R_LENGTH                 (3)
#define ISPOST_DNMC10_R_DEFAULT                (0)
#define ISPOST_DNMC10_R_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC10, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC10_Y_MASK                   (0x0000FF00)
#define ISPOST_DNMC10_Y_LSBMASK                (0x000000FF)
#define ISPOST_DNMC10_Y_SHIFT                  (8)
#define ISPOST_DNMC10_Y_LENGTH                 (8)
#define ISPOST_DNMC10_Y_DEFAULT                (0)
#define ISPOST_DNMC10_Y_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC10, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC10_X_MASK                   (0x000000FF)
#define ISPOST_DNMC10_X_LSBMASK                (0x000000FF)
#define ISPOST_DNMC10_X_SHIFT                  (0)
#define ISPOST_DNMC10_X_LENGTH                 (8)
#define ISPOST_DNMC10_X_DEFAULT                (0)
#define ISPOST_DNMC10_X_SIGNED_FIELD           (0)


//----------------------------------------------------------
// DNMC11 - DN Mask Curve 11 Register.
#define ISPOST_DNMC11_OFFSET                   (0x00E4)
#define ISPOST_DNMC11                          (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC11_OFFSET)

/*
 * ISPOST, DNMC11, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC11_S_MASK                   (0xFFF00000)
#define ISPOST_DNMC11_S_LSBMASK                (0x00000FFF)
#define ISPOST_DNMC11_S_SHIFT                  (20)
#define ISPOST_DNMC11_S_LENGTH                 (12)
#define ISPOST_DNMC11_S_DEFAULT                (0)
#define ISPOST_DNMC11_S_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC11, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC11_R_MASK                   (0x00070000)
#define ISPOST_DNMC11_R_LSBMASK                (0x00000007)
#define ISPOST_DNMC11_R_SHIFT                  (16)
#define ISPOST_DNMC11_R_LENGTH                 (3)
#define ISPOST_DNMC11_R_DEFAULT                (0)
#define ISPOST_DNMC11_R_SIGNED_FIELD           (0)

