vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, DNMC11, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC11_Y_MASK                   (0x0000FF00)
#define ISPOST_DNMC11_Y_LSBMASK                (0x000000FF)
#define ISPOST_DNMC11_Y_SHIFT                  (8)
#define ISPOST_DNMC11_Y_LENGTH                 (8)
#define ISPOST_DNMC11_Y_DEFAULT                (0)
#define ISPOST_DNMC11_Y_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC11, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC11_X_MASK                   (0x000000FF)
#define ISPOST_DNMC11_X_LSBMASK                (0x000000FF)
#define ISPOST_DNMC11_X_SHIFT                  (0)
#define ISPOST_DNMC11_X_LENGTH                 (8)
#define ISPOST_DNMC11_X_DEFAULT                (0)
#define ISPOST_DNMC11_X_SIGNED_FIELD           (0)


//----------------------------------------------------------
// DNMC12 - DN Mask Curve 12 Register.
#define ISPOST_DNMC12_OFFSET                   (0x00E8)
#define ISPOST_DNMC12                          (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC12_OFFSET)

/*
 * ISPOST, DNMC12, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC12_S_MASK                   (0xFFF00000)
#define ISPOST_DNMC12_S_LSBMASK                (0x00000FFF)
#define ISPOST_DNMC12_S_SHIFT                  (20)
#define ISPOST_DNMC12_S_LENGTH                 (12)
#define ISPOST_DNMC12_S_DEFAULT                (0)
#define ISPOST_DNMC12_S_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC12, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC12_R_MASK                   (0x00070000)
#define ISPOST_DNMC12_R_LSBMASK                (0x00000007)
#define ISPOST_DNMC12_R_SHIFT                  (16)
#define ISPOST_DNMC12_R_LENGTH                 (3)
#define ISPOST_DNMC12_R_DEFAULT                (0)
#define ISPOST_DNMC12_R_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC12, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC12_Y_MASK                   (0x0000FF00)
#define ISPOST_DNMC12_Y_LSBMASK                (0x000000FF)
#define ISPOST_DNMC12_Y_SHIFT                  (8)
#define ISPOST_DNMC12_Y_LENGTH                 (8)
#define ISPOST_DNMC12_Y_DEFAULT                (0)
#define ISPOST_DNMC12_Y_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC12, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC12_X_MASK                   (0x000000FF)
#define ISPOST_DNMC12_X_LSBMASK                (0x000000FF)
#define ISPOST_DNMC12_X_SHIFT                  (0)
#define ISPOST_DNMC12_X_LENGTH                 (8)
#define ISPOST_DNMC12_X_DEFAULT                (0)
#define ISPOST_DNMC12_X_SIGNED_FIELD           (0)


//----------------------------------------------------------
// DNMC13 - DN Mask Curve 13 Register.
#define ISPOST_DNMC13_OFFSET                   (0x00EC)
#define ISPOST_DNMC13                          (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC13_OFFSET)

/*
 * ISPOST, DNMC13, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC13_S_MASK                   (0xFFF00000)
#define ISPOST_DNMC13_S_LSBMASK                (0x00000FFF)
#define ISPOST_DNMC13_S_SHIFT                  (20)
#define ISPOST_DNMC13_S_LENGTH                 (12)
#define ISPOST_DNMC13_S_DEFAULT                (0)
#define ISPOST_DNMC13_S_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC13, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC13_R_MASK                   (0x00070000)
#define ISPOST_DNMC13_R_LSBMASK                (0x00000007)
#define ISPOST_DNMC13_R_SHIFT                  (16)
#define ISPOST_DNMC13_R_LENGTH                 (3)
#define ISPOST_DNMC13_R_DEFAULT                (0)
#define ISPOST_DNMC13_R_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC13, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC13_Y_MASK                   (0x0000FF00)
#define ISPOST_DNMC13_Y_LSBMASK                (0x000000FF)
#define ISPOST_DNMC13_Y_SHIFT                  (8)
#define ISPOST_DNMC13_Y_LENGTH                 (8)
#define ISPOST_DNMC13_Y_DEFAULT                (0)
#define ISPOST_DNMC13_Y_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC13, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC13_X_MASK                   (0x000000FF)
#define ISPOST_DNMC13_X_LSBMASK                (0x000000FF)
#define ISPOST_DNMC13_X_SHIFT                  (0)
#define ISPOST_DNMC13_X_LENGTH                 (8)
#define ISPOST_DNMC13_X_DEFAULT                (0)
#define ISPOST_DNMC13_X_SIGNED_FIELD           (0)


//----------------------------------------------------------
// DNMC14 - DN Mask Curve 14 Register.
#define ISPOST_DNMC14_OFFSET                   (0x00F0)
#define ISPOST_DNMC14                          (ISPOST_PERI_BASE_ADDR + ISPOST_DNMC14_OFFSET)

