vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, DNMC14, S
 * [31:20] S - Slope of mask value for mask curve. (format 0.0.12).
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC14_S_MASK                   (0xFFF00000)
#define ISPOST_DNMC14_S_LSBMASK                (0x00000FFF)
#define ISPOST_DNMC14_S_SHIFT                  (20)
#define ISPOST_DNMC14_S_LENGTH                 (12)
#define ISPOST_DNMC14_S_DEFAULT                (0)
#define ISPOST_DNMC14_S_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC14, R
 * [18:16] R - Absolute difference value range exponent: RANGE = 2^R.
 *             This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC14_R_MASK                   (0x00070000)
#define ISPOST_DNMC14_R_LSBMASK                (0x00000007)
#define ISPOST_DNMC14_R_SHIFT                  (16)
#define ISPOST_DNMC14_R_LENGTH                 (3)
#define ISPOST_DNMC14_R_DEFAULT                (0)
#define ISPOST_DNMC14_R_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC14, Y
 * [15:8] Y - Mask value for mask curve. (format 0.0.8).
 *            This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 */
#define ISPOST_DNMC14_Y_MASK                   (0x0000FF00)
#define ISPOST_DNMC14_Y_LSBMASK                (0x000000FF)
#define ISPOST_DNMC14_Y_SHIFT                  (8)
#define ISPOST_DNMC14_Y_LENGTH                 (8)
#define ISPOST_DNMC14_Y_DEFAULT                (0)
#define ISPOST_DNMC14_Y_SIGNED_FIELD           (0)

/*
 * ISPOST, DNMC14, X
 * [7:0] X - Absolute difference value for mask curve. (format 0.8.0).
 *           This register is indexed by DNCTRL0[IDX] (0F8H). Valid index values: 0-2.
 * -------------------------------------------------------------------------
 * NOTE: the difference of next point X and this point X values must match
 * this point range value R (RANGE(N) = 2^R(N) = X(N+1) - X(N))
 * -------------------------------------------------------------------------
 */
#define ISPOST_DNMC14_X_MASK                   (0x000000FF)
#define ISPOST_DNMC14_X_LSBMASK                (0x000000FF)
#define ISPOST_DNMC14_X_SHIFT                  (0)
#define ISPOST_DNMC14_X_LENGTH                 (8)
#define ISPOST_DNMC14_X_DEFAULT                (0)
#define ISPOST_DNMC14_X_SIGNED_FIELD           (0)


//----------------------------------------------------------
// DNCTRL0 - DN Control Register 0.
#define ISPOST_DNCTRL0_OFFSET                  (0x00F8)
#define ISPOST_DNCTRL0                         (ISPOST_PERI_BASE_ADDR + ISPOST_DNCTRL0_OFFSET)

/*
 * ISPOST, DNCTRL0, IDX
 * [25:24] IDX - DN mask curve index.
 *               0 : Y mask curve.
 *               1 : U mask curve.
 *               2 : V mask curve.
 *               3 : Reserved.
 */
#define ISPOST_DNCTRL0_IDX_MASK                (0x03000000)
#define ISPOST_DNCTRL0_IDX_LSBMASK             (0x00000003)
#define ISPOST_DNCTRL0_IDX_SHIFT               (24)
#define ISPOST_DNCTRL0_IDX_LENGTH              (2)
#define ISPOST_DNCTRL0_IDX_DEFAULT             (0)
#define ISPOST_DNCTRL0_IDX_SIGNED_FIELD        (0)


//----------------------------------------------------------
// DNAXI - DN AXI Control Register.
#define ISPOST_DNAXI_OFFSET                    (0x00FC)
#define ISPOST_DNAXI                           (ISPOST_PERI_BASE_ADDR + ISPOST_DNAXI_OFFSET)

/*
 * ISPOST, DNAXI, REFWID
 * [15:8] REFWID - Reference Image AXI Write ID.
 *                 (Please note: ALL AXI Read Ids must be unique).
 */
#define ISPOST_DNAXI_REFWID_MASK               (0x0000FF00)
#define ISPOST_DNAXI_REFWID_LSBMASK            (0x000000FF)
#define ISPOST_DNAXI_REFWID_SHIFT              (8)
#define ISPOST_DNAXI_REFWID_LENGTH             (8)
#define ISPOST_DNAXI_REFWID_DEFAULT            (0)
#define ISPOST_DNAXI_REFWID_SIGNED_FIELD       (0)

/*
 * ISPOST, DNAXI, REFRID
 * [7:0] REFRID - Reference Image AXI Read ID.
 *                (Please note: ALL AXI Read Ids must be unique).
 */
#define ISPOST_DNAXI_REFRID_MASK               (0x000000FF)
#define ISPOST_DNAXI_REFRID_LSBMASK            (0x000000FF)
#define ISPOST_DNAXI_REFRID_SHIFT              (0)
#define ISPOST_DNAXI_REFRID_LENGTH             (8)
#define ISPOST_DNAXI_REFRID_DEFAULT            (0)
#define ISPOST_DNAXI_REFRID_SIGNED_FIELD       (0)



//==========================================================
// Scaled output registers offset.
//----------------------------------------------------------
// SS0AY - SS0 Output Image Y Plane Start Address Register.
#define ISPOST_SS0AY_OFFSET                    (0x0100)
#define ISPOST_SS0AY                           (ISPOST_PERI_BASE_ADDR + ISPOST_SS0AY_OFFSET)

/*
 * ISPOST, SS0AY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_SS0AY_SAD_MASK                  (0xFFFFFFF8)
#define ISPOST_SS0AY_SAD_LSBMASK               (0xFFFFFFF8)
#define ISPOST_SS0AY_SAD_SHIFT                 (0)
#define ISPOST_SS0AY_SAD_LENGTH                (32)
#define ISPOST_SS0AY_SAD_DEFAULT               (0)
#define ISPOST_SS0AY_SAD_SIGNED_FIELD          (0)


//----------------------------------------------------------
// SS0AUV - SS0 Output Image UV Plane Start Address Register.
#define ISPOST_SS0AUV_OFFSET                   (0x0104)
#define ISPOST_SS0AUV                          (ISPOST_PERI_BASE_ADDR + ISPOST_SS0AUV_OFFSET)

/*
 * ISPOST, SS0AUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_SS0AUV_SAD_MASK                 (0xFFFFFFF8)
#define ISPOST_SS0AUV_SAD_LSBMASK              (0xFFFFFFF8)
#define ISPOST_SS0AUV_SAD_SHIFT                (0)
#define ISPOST_SS0AUV_SAD_LENGTH               (32)
#define ISPOST_SS0AUV_SAD_DEFAULT              (0)
#define ISPOST_SS0AUV_SAD_SIGNED_FIELD         (0)


//----------------------------------------------------------
// SS0S - SS0 Output Image Stride Register.
#define ISPOST_SS0S_OFFSET                     (0x0108)
#define ISPOST_SS0S                            (ISPOST_PERI_BASE_ADDR + ISPOST_SS0S_OFFSET)

