vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, SS0S, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_SS0S_SD_MASK                    (0x00001FF8)
#define ISPOST_SS0S_SD_LSBMASK                 (0x00001FF8)
#define ISPOST_SS0S_SD_SHIFT                   (0)
#define ISPOST_SS0S_SD_LENGTH                  (13)
#define ISPOST_SS0S_SD_DEFAULT                 (0)
#define ISPOST_SS0S_SD_SIGNED_FIELD            (0)


//----------------------------------------------------------
// SS0HF - SS0 H Scaling Factor Register.
#define ISPOST_SS0HF_OFFSET                    (0x010C)
#define ISPOST_SS0HF                           (ISPOST_PERI_BASE_ADDR + ISPOST_SS0HF_OFFSET)

/*
 * ISPOST, SS0HF, SF
 * [27:16] SF - Scaling factor (format 0.0.12).
 */
#define ISPOST_SS0HF_SF_MASK                   (0x0FFF0000)
#define ISPOST_SS0HF_SF_LSBMASK                (0x00000FFF)
#define ISPOST_SS0HF_SF_SHIFT                  (16)
#define ISPOST_SS0HF_SF_LENGTH                 (12)
#define ISPOST_SS0HF_SF_DEFAULT                (0)
#define ISPOST_SS0HF_SF_SIGNED_FIELD           (0)

/*
 * ISPOST, SS0HF, SM
 * [1:0] SM - scaling mode.
 *            00 : Scale down.
 *            01 : Reserved.
 *            10 : No scaling.
 *            11 : Reserved.
 */
#define ISPOST_SS0HF_SM_MASK                   (0x00000003)
#define ISPOST_SS0HF_SM_LSBMASK                (0x00000003)
#define ISPOST_SS0HF_SM_SHIFT                  (0)
#define ISPOST_SS0HF_SM_LENGTH                 (2)
#define ISPOST_SS0HF_SM_DEFAULT                (0)
#define ISPOST_SS0HF_SM_SIGNED_FIELD           (0)


//----------------------------------------------------------
// SS0VF - SS0 V Scaling Factor Register.
#define ISPOST_SS0VF_OFFSET                    (0x0110)
#define ISPOST_SS0VF                           (ISPOST_PERI_BASE_ADDR + ISPOST_SS0VF_OFFSET)

/*
 * ISPOST, SS0VF, SF
 * [27:16] SF - Scaling factor (format 0.0.12)  Minimum vertical scaling factor is x1/8.
 */
#define ISPOST_SS0VF_SF_MASK                   (0x0FFF0000)
#define ISPOST_SS0VF_SF_LSBMASK                (0x00000FFF)
#define ISPOST_SS0VF_SF_SHIFT                  (16)
#define ISPOST_SS0VF_SF_LENGTH                 (12)
#define ISPOST_SS0VF_SF_DEFAULT                (0)
#define ISPOST_SS0VF_SF_SIGNED_FIELD           (0)

/*
 * ISPOST, SS0VF, SM
 * [1:0] SM - scaling mode.
 *            00 : Scale down.
 *            01 : Reserved.
 *            10 : No scaling.
 *            11 : Reserved.
 */
#define ISPOST_SS0VF_SM_MASK                   (0x00000003)
#define ISPOST_SS0VF_SM_LSBMASK                (0x00000003)
#define ISPOST_SS0VF_SM_SHIFT                  (0)
#define ISPOST_SS0VF_SM_LENGTH                 (2)
#define ISPOST_SS0VF_SM_DEFAULT                (0)
#define ISPOST_SS0VF_SM_SIGNED_FIELD           (0)


//----------------------------------------------------------
// SS0IW - SS0 Output Image Size Register.
#define ISPOST_SS0IW_OFFSET                    (0x0114)
#define ISPOST_SS0IW                           (ISPOST_PERI_BASE_ADDR + ISPOST_SS0IW_OFFSET)

/*
 * ISPOST, SS0IW, W
 * [28:16] W - Output image width (pixel granularity).
 */
#define ISPOST_SS0IW_W_MASK                    (0x1FFF0000)
#define ISPOST_SS0IW_W_LSBMASK                 (0x00001FFF)
#define ISPOST_SS0IW_W_SHIFT                   (16)
#define ISPOST_SS0IW_W_LENGTH                  (13)
#define ISPOST_SS0IW_W_DEFAULT                 (0)
#define ISPOST_SS0IW_W_SIGNED_FIELD            (0)

/*
 * ISPOST, SS0IW, H
 * [12:0] H - Output image height (line granularity).
 */
#define ISPOST_SS0IW_H_MASK                    (0x00001FFF)
#define ISPOST_SS0IW_H_LSBMASK                 (0x00001FFF)
#define ISPOST_SS0IW_H_SHIFT                   (0)
#define ISPOST_SS0IW_H_LENGTH                  (13)
#define ISPOST_SS0IW_H_DEFAULT                 (0)
#define ISPOST_SS0IW_H_SIGNED_FIELD            (0)


//----------------------------------------------------------
// SS1AY - SS1 Output Image Y Plane Start Address Register.
#define ISPOST_SS1AY_OFFSET                    (0x0118)
#define ISPOST_SS1AY                           (ISPOST_PERI_BASE_ADDR + ISPOST_SS1AY_OFFSET)

/*
 * ISPOST, SS1AY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_SS1AY_SAD_MASK                  (0xFFFFFFF8)
#define ISPOST_SS1AY_SAD_LSBMASK               (0xFFFFFFF8)
#define ISPOST_SS1AY_SAD_SHIFT                 (0)
#define ISPOST_SS1AY_SAD_LENGTH                (32)
#define ISPOST_SS1AY_SAD_DEFAULT               (0)
#define ISPOST_SS1AY_SAD_SIGNED_FIELD          (0)


//----------------------------------------------------------
// SS1AUV - SS1 Output Image UV Plane Start Address Register.
#define ISPOST_SS1AUV_OFFSET                   (0x011C)
#define ISPOST_SS1AUV                          (ISPOST_PERI_BASE_ADDR + ISPOST_SS1AUV_OFFSET)

/*
 * ISPOST, SS1AUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_SS1AUV_SAD_MASK                 (0xFFFFFFF8)
#define ISPOST_SS1AUV_SAD_LSBMASK              (0xFFFFFFF8)
#define ISPOST_SS1AUV_SAD_SHIFT                (0)
#define ISPOST_SS1AUV_SAD_LENGTH               (32)
#define ISPOST_SS1AUV_SAD_DEFAULT              (0)
#define ISPOST_SS1AUV_SAD_SIGNED_FIELD         (0)


//----------------------------------------------------------
// SS1S - SS1 Output Image Stride Register.
#define ISPOST_SS1S_OFFSET                     (0x0120)
#define ISPOST_SS1S                            (ISPOST_PERI_BASE_ADDR + ISPOST_SS1S_OFFSET)

/*
 * ISPOST, SS1S, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_SS1S_SD_MASK                    (0x00001FF8)
#define ISPOST_SS1S_SD_LSBMASK                 (0x00001FF8)
#define ISPOST_SS1S_SD_SHIFT                   (0)
#define ISPOST_SS1S_SD_LENGTH                  (13)
#define ISPOST_SS1S_SD_DEFAULT                 (0)
#define ISPOST_SS1S_SD_SIGNED_FIELD            (0)


//----------------------------------------------------------
// SS1HF - SS1 H Scaling Factor Register.
#define ISPOST_SS1HF_OFFSET                    (0x0124)
#define ISPOST_SS1HF                           (ISPOST_PERI_BASE_ADDR + ISPOST_SS1HF_OFFSET)

