vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, SS1HF, SF
 * [27:16] SF - Scaling factor (format 0.0.12).
 */
#define ISPOST_SS1HF_SF_MASK                   (0x0FFF0000)
#define ISPOST_SS1HF_SF_LSBMASK                (0x00000FFF)
#define ISPOST_SS1HF_SF_SHIFT                  (16)
#define ISPOST_SS1HF_SF_LENGTH                 (12)
#define ISPOST_SS1HF_SF_DEFAULT                (0)
#define ISPOST_SS1HF_SF_SIGNED_FIELD           (0)

/*
 * ISPOST, SS1HF, SM
 * [1:0] SM - scaling mode.
 *            00 : Scale down.
 *            01 : Reserved.
 *            10 : No scaling.
 *            11 : Reserved.
 */
#define ISPOST_SS1HF_SM_MASK                   (0x00000003)
#define ISPOST_SS1HF_SM_LSBMASK                (0x00000003)
#define ISPOST_SS1HF_SM_SHIFT                  (0)
#define ISPOST_SS1HF_SM_LENGTH                 (2)
#define ISPOST_SS1HF_SM_DEFAULT                (0)
#define ISPOST_SS1HF_SM_SIGNED_FIELD           (0)


//----------------------------------------------------------
// SS1VF - SS1 V Scaling Factor Register.
#define ISPOST_SS1VF_OFFSET                    (0x0128)
#define ISPOST_SS1VF                           (ISPOST_PERI_BASE_ADDR + ISPOST_SS1VF_OFFSET)

/*
 * ISPOST, SS1VF, SF
 * [27:16] SF - Scaling factor (format 0.0.12)  Minimum vertical scaling factor is x1/8.
 */
#define ISPOST_SS1VF_SF_MASK                   (0x0FFF0000)
#define ISPOST_SS1VF_SF_LSBMASK                (0x00000FFF)
#define ISPOST_SS1VF_SF_SHIFT                  (16)
#define ISPOST_SS1VF_SF_LENGTH                 (12)
#define ISPOST_SS1VF_SF_DEFAULT                (0)
#define ISPOST_SS1VF_SF_SIGNED_FIELD           (0)

/*
 * ISPOST, SS1VF, SM
 * [1:0] SM - scaling mode.
 *            00 : Scale down.
 *            01 : Reserved.
 *            10 : No scaling.
 *            11 : Reserved.
 */
#define ISPOST_SS1VF_SM_MASK                   (0x00000003)
#define ISPOST_SS1VF_SM_LSBMASK                (0x00000003)
#define ISPOST_SS1VF_SM_SHIFT                  (0)
#define ISPOST_SS1VF_SM_LENGTH                 (2)
#define ISPOST_SS1VF_SM_DEFAULT                (0)
#define ISPOST_SS1VF_SM_SIGNED_FIELD           (0)


//----------------------------------------------------------
// SS1IW - SS1 Output Image Size Register.
#define ISPOST_SS1IW_OFFSET                    (0x012C)
#define ISPOST_SS1IW                           (ISPOST_PERI_BASE_ADDR + ISPOST_SS1IW_OFFSET)

/*
 * ISPOST, SS1IW, W
 * [28:16] W - Output image width (pixel granularity).
 */
#define ISPOST_SS1IW_W_MASK                    (0x1FFF0000)
#define ISPOST_SS1IW_W_LSBMASK                 (0x00001FFF)
#define ISPOST_SS1IW_W_SHIFT                   (16)
#define ISPOST_SS1IW_W_LENGTH                  (13)
#define ISPOST_SS1IW_W_DEFAULT                 (0)
#define ISPOST_SS1IW_W_SIGNED_FIELD            (0)

/*
 * ISPOST, SS1IW, H
 * [12:0] H - Output image height (line granularity).
 */
#define ISPOST_SS1IW_H_MASK                    (0x00001FFF)
#define ISPOST_SS1IW_H_LSBMASK                 (0x00001FFF)
#define ISPOST_SS1IW_H_SHIFT                   (0)
#define ISPOST_SS1IW_H_LENGTH                  (13)
#define ISPOST_SS1IW_H_DEFAULT                 (0)
#define ISPOST_SS1IW_H_SIGNED_FIELD            (0)


//----------------------------------------------------------
// SSAXI - SS AXI Control Register.
#define ISPOST_SSAXI_OFFSET                    (0x013C)
#define ISPOST_SSAXI                           (ISPOST_PERI_BASE_ADDR + ISPOST_SSAXI_OFFSET)

/*
 * ISPOST, SSAXI, SS1WID
 * [15:8] SS1WID - SS1 Image AXI Write ID.
 *                 (Please note: ALL AXI Read Ids must be unique).
 */
#define ISPOST_SSAXI_SS1WID_MASK               (0x0000FF00)
#define ISPOST_SSAXI_SS1WID_LSBMASK            (0x000000FF)
#define ISPOST_SSAXI_SS1WID_SHIFT              (8)
#define ISPOST_SSAXI_SS1WID_LENGTH             (8)
#define ISPOST_SSAXI_SS1WID_DEFAULT            (0)
#define ISPOST_SSAXI_SS1WID_SIGNED_FIELD       (0)


/*
 * ISPOST, SSAXI, SS0WID
 * [7:0] SS0WID - SS1 Image AXI Write ID.
 *               (Please note: ALL AXI Read Ids must be unique).
 */
#define ISPOST_SSAXI_SS0WID_MASK               (0x000000FF)
#define ISPOST_SSAXI_SS0WID_LSBMASK            (0x000000FF)
#define ISPOST_SSAXI_SS0WID_SHIFT              (0)
#define ISPOST_SSAXI_SS0WID_LENGTH             (8)
#define ISPOST_SSAXI_SS0WID_DEFAULT            (0)
#define ISPOST_SSAXI_SS0WID_SIGNED_FIELD       (0)



//==========================================================
// Video stabilization registers offset.
//----------------------------------------------------------
// VSCTRL0 - Video Stabilization Control Register 0.
#define ISPOST_VSCTRL0_OFFSET                  (0x0140)
#define ISPOST_VSCTRL0                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSCTRL0_OFFSET)

/*
 * ISPOST, VSCTRL0, FLIPH
 * [5] FLIPH - Horizontal Flip enable.
 */
#define ISPOST_VSCTRL0_FLIPH_MASK              (0x00000020)
#define ISPOST_VSCTRL0_FLIPH_LSBMASK           (0x00000001)
#define ISPOST_VSCTRL0_FLIPH_SHIFT             (5)
#define ISPOST_VSCTRL0_FLIPH_LENGTH            (1)
#define ISPOST_VSCTRL0_FLIPH_DEFAULT           (0)
#define ISPOST_VSCTRL0_FLIPH_SIGNED_FIELD      (0)

/*
 * ISPOST, VSCTRL0, FLIPV
 * [4] FLIPV - Vertical Flip enable.
 */
#define ISPOST_VSCTRL0_FLIPV_MASK              (0x00000010)
#define ISPOST_VSCTRL0_FLIPV_LSBMASK           (0x00000001)
#define ISPOST_VSCTRL0_FLIPV_SHIFT             (4)
#define ISPOST_VSCTRL0_FLIPV_LENGTH            (1)
#define ISPOST_VSCTRL0_FLIPV_DEFAULT           (0)
#define ISPOST_VSCTRL0_FLIPV_SIGNED_FIELD      (0)

/*
 * ISPOST, VSCTRL0, ROT
 * [3:2] ROT - Rotation Mode.
 *             00 : No rotation.
 *             01 : Reserved.
 *             10 : Rotate 90deg.
 *             11 : Rotate 270deg.
 */
#define ISPOST_VSCTRL0_ROT_MASK                (0x0000000C)
#define ISPOST_VSCTRL0_ROT_LSBMASK             (0x00000003)
#define ISPOST_VSCTRL0_ROT_SHIFT               (2)
#define ISPOST_VSCTRL0_ROT_LENGTH              (2)
#define ISPOST_VSCTRL0_ROT_DEFAULT             (0)
#define ISPOST_VSCTRL0_ROT_SIGNED_FIELD        (0)

