vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, VSCTRL0, REN
 * [0] REN - Rolling shutter compensation enable.
 */
#define ISPOST_VSCTRL0_REN_MASK                (0x00000001)
#define ISPOST_VSCTRL0_REN_LSBMASK             (0x00000001)
#define ISPOST_VSCTRL0_REN_SHIFT               (0)
#define ISPOST_VSCTRL0_REN_LENGTH              (1)
#define ISPOST_VSCTRL0_REN_DEFAULT             (0)
#define ISPOST_VSCTRL0_REN_SIGNED_FIELD        (0)


//----------------------------------------------------------
// VSWC0 - Video Stabilization Window Coordinate Register 0.
#define ISPOST_VSWC0_OFFSET                    (0x0150)
#define ISPOST_VSWC0                           (ISPOST_PERI_BASE_ADDR + ISPOST_VSWC0_OFFSET)

/*
 * ISPOST, VSWC0, COLX
 * [28:16] COLX - X coordinate of the upper left corner pixel of the first window in the column 0. (refer to figure below)
 */
#define ISPOST_VSWC0_COLX_MASK                 (0x1FFF0000)
#define ISPOST_VSWC0_COLX_LSBMASK              (0x00001FFF)
#define ISPOST_VSWC0_COLX_SHIFT                (16)
#define ISPOST_VSWC0_COLX_LENGTH               (13)
#define ISPOST_VSWC0_COLX_DEFAULT              (0)
#define ISPOST_VSWC0_COLX_SIGNED_FIELD         (0)

/*
 * ISPOST, VSWC0, ROWY
 * [12:0] ROWY - Y coordinate of the upper left corner of the first window in the row 0. (refer to figure below)
 */
#define ISPOST_VSWC0_ROWY_MASK                 (0x00001FFF)
#define ISPOST_VSWC0_ROWY_LSBMASK              (0x00001FFF)
#define ISPOST_VSWC0_ROWY_SHIFT                (0)
#define ISPOST_VSWC0_ROWY_LENGTH               (13)
#define ISPOST_VSWC0_ROWY_DEFAULT              (0)
#define ISPOST_VSWC0_ROWY_SIGNED_FIELD         (0)


//----------------------------------------------------------
// VSWC1 - Video Stabilization Window Coordinate Register 1.
#define ISPOST_VSWC1_OFFSET                    (0x0154)
#define ISPOST_VSWC1                           (ISPOST_PERI_BASE_ADDR + ISPOST_VSWC1_OFFSET)

/*
 * ISPOST, VSWC1, COLX
 * [28:16] COLX - X coordinate of the upper left corner pixel of the first window in the column 1. (refer to figure below)
 */
#define ISPOST_VSWC1_COLX_MASK                 (0x1FFF0000)
#define ISPOST_VSWC1_COLX_LSBMASK              (0x00001FFF)
#define ISPOST_VSWC1_COLX_SHIFT                (16)
#define ISPOST_VSWC1_COLX_LENGTH               (13)
#define ISPOST_VSWC1_COLX_DEFAULT              (0)
#define ISPOST_VSWC1_COLX_SIGNED_FIELD         (0)

/*
 * ISPOST, VSWC1, ROWY
 * [12:0] ROWY - Y coordinate of the upper left corner of the first window in the row 1. (refer to figure below)
 */
#define ISPOST_VSWC1_ROWY_MASK                 (0x00001FFF)
#define ISPOST_VSWC1_ROWY_LSBMASK              (0x00001FFF)
#define ISPOST_VSWC1_ROWY_SHIFT                (0)
#define ISPOST_VSWC1_ROWY_LENGTH               (13)
#define ISPOST_VSWC1_ROWY_DEFAULT              (0)
#define ISPOST_VSWC1_ROWY_SIGNED_FIELD         (0)


//----------------------------------------------------------
// VSWC2 - Video Stabilization Window Coordinate Register 2.
#define ISPOST_VSWC2_OFFSET                    (0x0158)
#define ISPOST_VSWC2                           (ISPOST_PERI_BASE_ADDR + ISPOST_VSWC2_OFFSET)

/*
 * ISPOST, VSWC2, COLX
 * [28:16] COLX - X coordinate of the upper left corner pixel of the first window in the column 2. (refer to figure below)
 */
#define ISPOST_VSWC2_COLX_MASK                 (0x1FFF0000)
#define ISPOST_VSWC2_COLX_LSBMASK              (0x00001FFF)
#define ISPOST_VSWC2_COLX_SHIFT                (16)
#define ISPOST_VSWC2_COLX_LENGTH               (13)
#define ISPOST_VSWC2_COLX_DEFAULT              (0)
#define ISPOST_VSWC2_COLX_SIGNED_FIELD         (0)

/*
 * ISPOST, VSWC2, ROWY
 * [12:0] ROWY - Y coordinate of the upper left corner of the first window in the row 2. (refer to figure below)
 */
#define ISPOST_VSWC2_ROWY_MASK                 (0x00001FFF)
#define ISPOST_VSWC2_ROWY_LSBMASK              (0x00001FFF)
#define ISPOST_VSWC2_ROWY_SHIFT                (0)
#define ISPOST_VSWC2_ROWY_LENGTH               (13)
#define ISPOST_VSWC2_ROWY_DEFAULT              (0)
#define ISPOST_VSWC2_ROWY_SIGNED_FIELD         (0)


//----------------------------------------------------------
// VSWC3 - Video Stabilization Window Coordinate Register 3.
#define ISPOST_VSWC3_OFFSET                    (0x015C)
#define ISPOST_VSWC3                           (ISPOST_PERI_BASE_ADDR + ISPOST_VSWC3_OFFSET)

/*
 * ISPOST, VSWC3, COLX
 * [28:16] COLX - X coordinate of the upper left corner pixel of the first window in the column 3. (refer to figure below)
 */
#define ISPOST_VSWC3_COLX_MASK                 (0x1FFF0000)
#define ISPOST_VSWC3_COLX_LSBMASK              (0x00001FFF)
#define ISPOST_VSWC3_COLX_SHIFT                (16)
#define ISPOST_VSWC3_COLX_LENGTH               (13)
#define ISPOST_VSWC3_COLX_DEFAULT              (0)
#define ISPOST_VSWC3_COLX_SIGNED_FIELD         (0)


//----------------------------------------------------------
// VSLMV00 - Video Stabilization Local Motion Vector 00 Register.
#define ISPOST_VSLMV00_OFFSET                  (0x0160)
#define ISPOST_VSLMV00                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV00_OFFSET)

/*
 * ISPOST, VSLMV00, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV00_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV00_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV00_X_SHIFT                 (16)
#define ISPOST_VSLMV00_X_LENGTH                (8)
#define ISPOST_VSLMV00_X_DEFAULT               (0)
#define ISPOST_VSLMV00_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV00, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV00_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV00_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV00_Y_SHIFT                 (0)
#define ISPOST_VSLMV00_Y_LENGTH                (8)
#define ISPOST_VSLMV00_Y_DEFAULT               (0)
#define ISPOST_VSLMV00_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV10 - Video Stabilization Local Motion Vector 10 Register.
#define ISPOST_VSLMV10_OFFSET                  (0x0164)
#define ISPOST_VSLMV10                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV10_OFFSET)

