vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, VSLMV10, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV10_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV10_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV10_X_SHIFT                 (16)
#define ISPOST_VSLMV10_X_LENGTH                (8)
#define ISPOST_VSLMV10_X_DEFAULT               (0)
#define ISPOST_VSLMV10_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV10, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV10_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV10_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV10_Y_SHIFT                 (0)
#define ISPOST_VSLMV10_Y_LENGTH                (8)
#define ISPOST_VSLMV10_Y_DEFAULT               (0)
#define ISPOST_VSLMV10_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV20 - Video Stabilization Local Motion Vector 20 Register.
#define ISPOST_VSLMV20_OFFSET                  (0x0168)
#define ISPOST_VSLMV20                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV20_OFFSET)

/*
 * ISPOST, VSLMV20, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV20_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV20_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV20_X_SHIFT                 (16)
#define ISPOST_VSLMV20_X_LENGTH                (8)
#define ISPOST_VSLMV20_X_DEFAULT               (0)
#define ISPOST_VSLMV20_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV20, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV20_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV20_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV20_Y_SHIFT                 (0)
#define ISPOST_VSLMV20_Y_LENGTH                (8)
#define ISPOST_VSLMV20_Y_DEFAULT               (0)
#define ISPOST_VSLMV20_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV30 - Video Stabilization Local Motion Vector 30 Register.
#define ISPOST_VSLMV30_OFFSET                  (0x016C)
#define ISPOST_VSLMV30                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV30_OFFSET)

/*
 * ISPOST, VSLMV30, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV30_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV30_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV30_X_SHIFT                 (16)
#define ISPOST_VSLMV30_X_LENGTH                (8)
#define ISPOST_VSLMV30_X_DEFAULT               (0)
#define ISPOST_VSLMV30_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV30, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV30_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV30_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV30_Y_SHIFT                 (0)
#define ISPOST_VSLMV30_Y_LENGTH                (8)
#define ISPOST_VSLMV30_Y_DEFAULT               (0)
#define ISPOST_VSLMV30_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV01 - Video Stabilization Local Motion Vector 01 Register.
#define ISPOST_VSLMV01_OFFSET                  (0x0170)
#define ISPOST_VSLMV01                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV01_OFFSET)

/*
 * ISPOST, VSLMV01, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV01_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV01_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV01_X_SHIFT                 (16)
#define ISPOST_VSLMV01_X_LENGTH                (8)
#define ISPOST_VSLMV01_X_DEFAULT               (0)
#define ISPOST_VSLMV01_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV01, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV01_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV01_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV01_Y_SHIFT                 (0)
#define ISPOST_VSLMV01_Y_LENGTH                (8)
#define ISPOST_VSLMV01_Y_DEFAULT               (0)
#define ISPOST_VSLMV01_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV11 - Video Stabilization Local Motion Vector 11 Register.
#define ISPOST_VSLMV11_OFFSET                  (0x0174)
#define ISPOST_VSLMV11                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV11_OFFSET)

/*
 * ISPOST, VSLMV11, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV11_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV11_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV11_X_SHIFT                 (16)
#define ISPOST_VSLMV11_X_LENGTH                (8)
#define ISPOST_VSLMV11_X_DEFAULT               (0)
#define ISPOST_VSLMV11_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV11, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV11_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV11_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV11_Y_SHIFT                 (0)
#define ISPOST_VSLMV11_Y_LENGTH                (8)
#define ISPOST_VSLMV11_Y_DEFAULT               (0)
#define ISPOST_VSLMV11_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV21 - Video Stabilization Local Motion Vector 21 Register.
#define ISPOST_VSLMV21_OFFSET                  (0x0178)
#define ISPOST_VSLMV21                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV21_OFFSET)

/*
 * ISPOST, VSLMV21, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV21_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV21_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV21_X_SHIFT                 (16)
#define ISPOST_VSLMV21_X_LENGTH                (8)
#define ISPOST_VSLMV21_X_DEFAULT               (0)
#define ISPOST_VSLMV21_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV21, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV21_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV21_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV21_Y_SHIFT                 (0)
#define ISPOST_VSLMV21_Y_LENGTH                (8)
#define ISPOST_VSLMV21_Y_DEFAULT               (0)
#define ISPOST_VSLMV21_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV31 - Video Stabilization Local Motion Vector 31 Register.
#define ISPOST_VSLMV31_OFFSET                  (0x017C)
#define ISPOST_VSLMV31                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV31_OFFSET)

