vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, VSLMV31, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV31_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV31_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV31_X_SHIFT                 (16)
#define ISPOST_VSLMV31_X_LENGTH                (8)
#define ISPOST_VSLMV31_X_DEFAULT               (0)
#define ISPOST_VSLMV31_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV31, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV31_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV31_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV31_Y_SHIFT                 (0)
#define ISPOST_VSLMV31_Y_LENGTH                (8)
#define ISPOST_VSLMV31_Y_DEFAULT               (0)
#define ISPOST_VSLMV31_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV02 - Video Stabilization Local Motion Vector 02 Register.
#define ISPOST_VSLMV02_OFFSET                  (0x0180)
#define ISPOST_VSLMV02                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV02_OFFSET)

/*
 * ISPOST, VSLMV02, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV02_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV02_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV02_X_SHIFT                 (16)
#define ISPOST_VSLMV02_X_LENGTH                (8)
#define ISPOST_VSLMV02_X_DEFAULT               (0)
#define ISPOST_VSLMV02_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV02, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV02_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV02_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV02_Y_SHIFT                 (0)
#define ISPOST_VSLMV02_Y_LENGTH                (8)
#define ISPOST_VSLMV02_Y_DEFAULT               (0)
#define ISPOST_VSLMV02_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV12 - Video Stabilization Local Motion Vector 12 Register.
#define ISPOST_VSLMV12_OFFSET                  (0x0184)
#define ISPOST_VSLMV12                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV12_OFFSET)

/*
 * ISPOST, VSLMV12, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV12_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV12_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV12_X_SHIFT                 (16)
#define ISPOST_VSLMV12_X_LENGTH                (8)
#define ISPOST_VSLMV12_X_DEFAULT               (0)
#define ISPOST_VSLMV12_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV12, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV12_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV12_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV12_Y_SHIFT                 (0)
#define ISPOST_VSLMV12_Y_LENGTH                (8)
#define ISPOST_VSLMV12_Y_DEFAULT               (0)
#define ISPOST_VSLMV12_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV22 - Video Stabilization Local Motion Vector 22 Register.
#define ISPOST_VSLMV22_OFFSET                  (0x0188)
#define ISPOST_VSLMV22                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV22_OFFSET)

/*
 * ISPOST, VSLMV22, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV22_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV22_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV22_X_SHIFT                 (16)
#define ISPOST_VSLMV22_X_LENGTH                (8)
#define ISPOST_VSLMV22_X_DEFAULT               (0)
#define ISPOST_VSLMV22_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV22, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV22_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV22_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV22_Y_SHIFT                 (0)
#define ISPOST_VSLMV22_Y_LENGTH                (8)
#define ISPOST_VSLMV22_Y_DEFAULT               (0)
#define ISPOST_VSLMV22_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSLMV32 - Video Stabilization Local Motion Vector 32 Register.
#define ISPOST_VSLMV32_OFFSET                  (0x018C)
#define ISPOST_VSLMV32                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSLMV32_OFFSET)

/*
 * ISPOST, VSLMV32, X
 * [23:16] X - Local motion vector X coordinate.
 */
#define ISPOST_VSLMV32_X_MASK                  (0x00FF0000)
#define ISPOST_VSLMV32_X_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV32_X_SHIFT                 (16)
#define ISPOST_VSLMV32_X_LENGTH                (8)
#define ISPOST_VSLMV32_X_DEFAULT               (0)
#define ISPOST_VSLMV32_X_SIGNED_FIELD          (0)

/*
 * ISPOST, VSLMV32, Y
 * [7:0] Y - Local motion vector Y coordinate.
 */
#define ISPOST_VSLMV32_Y_MASK                  (0x000000FF)
#define ISPOST_VSLMV32_Y_LSBMASK               (0x000000FF)
#define ISPOST_VSLMV32_Y_SHIFT                 (0)
#define ISPOST_VSLMV32_Y_LENGTH                (8)
#define ISPOST_VSLMV32_Y_DEFAULT               (0)
#define ISPOST_VSLMV32_Y_SIGNED_FIELD          (0)


//----------------------------------------------------------
// VSCT00 - Video Stabilization Contrast 00 Register.
#define ISPOST_VSCT00_OFFSET                   (0x0190)
#define ISPOST_VSCT00                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT00_OFFSET)

/*
 * ISPOST, VSCT00, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT00_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT00_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT00_X_SHIFT                  (16)
#define ISPOST_VSCT00_X_LENGTH                 (16)
#define ISPOST_VSCT00_X_DEFAULT                (0)
#define ISPOST_VSCT00_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT00, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT00_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT00_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT00_Y_SHIFT                  (0)
#define ISPOST_VSCT00_Y_LENGTH                 (16)
#define ISPOST_VSCT00_Y_DEFAULT                (0)
#define ISPOST_VSCT00_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT10 - Video Stabilization Contrast 10 Register.
#define ISPOST_VSCT10_OFFSET                   (0x0194)
#define ISPOST_VSCT10                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT10_OFFSET)

