vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, VSCT10, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT10_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT10_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT10_X_SHIFT                  (16)
#define ISPOST_VSCT10_X_LENGTH                 (16)
#define ISPOST_VSCT10_X_DEFAULT                (0)
#define ISPOST_VSCT10_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT10, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT10_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT10_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT10_Y_SHIFT                  (0)
#define ISPOST_VSCT10_Y_LENGTH                 (16)
#define ISPOST_VSCT10_Y_DEFAULT                (0)
#define ISPOST_VSCT10_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT20 - Video Stabilization Contrast 20 Register.
#define ISPOST_VSCT20_OFFSET                   (0x0198)
#define ISPOST_VSCT20                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT20_OFFSET)

/*
 * ISPOST, VSCT20, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT20_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT20_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT20_X_SHIFT                  (16)
#define ISPOST_VSCT20_X_LENGTH                 (16)
#define ISPOST_VSCT20_X_DEFAULT                (0)
#define ISPOST_VSCT20_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT20, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT20_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT20_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT20_Y_SHIFT                  (0)
#define ISPOST_VSCT20_Y_LENGTH                 (16)
#define ISPOST_VSCT20_Y_DEFAULT                (0)
#define ISPOST_VSCT20_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT30 - Video Stabilization Contrast 30 Register.
#define ISPOST_VSCT30_OFFSET                   (0x019C)
#define ISPOST_VSCT30                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT30_OFFSET)

/*
 * ISPOST, VSCT30, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT30_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT30_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT30_X_SHIFT                  (16)
#define ISPOST_VSCT30_X_LENGTH                 (16)
#define ISPOST_VSCT30_X_DEFAULT                (0)
#define ISPOST_VSCT30_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT30, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT30_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT30_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT30_Y_SHIFT                  (0)
#define ISPOST_VSCT30_Y_LENGTH                 (16)
#define ISPOST_VSCT30_Y_DEFAULT                (0)
#define ISPOST_VSCT30_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT01 - Video Stabilization Contrast 01 Register.
#define ISPOST_VSCT01_OFFSET                   (0x01A0)
#define ISPOST_VSCT01                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT01_OFFSET)

/*
 * ISPOST, VSCT01, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT01_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT01_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT01_X_SHIFT                  (16)
#define ISPOST_VSCT01_X_LENGTH                 (16)
#define ISPOST_VSCT01_X_DEFAULT                (0)
#define ISPOST_VSCT01_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT01, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT01_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT01_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT01_Y_SHIFT                  (0)
#define ISPOST_VSCT01_Y_LENGTH                 (16)
#define ISPOST_VSCT01_Y_DEFAULT                (0)
#define ISPOST_VSCT01_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT11 - Video Stabilization Contrast 11 Register.
#define ISPOST_VSCT11_OFFSET                   (0x01A4)
#define ISPOST_VSCT11                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT11_OFFSET)

/*
 * ISPOST, VSCT11, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT11_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT11_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT11_X_SHIFT                  (16)
#define ISPOST_VSCT11_X_LENGTH                 (16)
#define ISPOST_VSCT11_X_DEFAULT                (0)
#define ISPOST_VSCT11_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT11, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT11_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT11_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT11_Y_SHIFT                  (0)
#define ISPOST_VSCT11_Y_LENGTH                 (16)
#define ISPOST_VSCT11_Y_DEFAULT                (0)
#define ISPOST_VSCT11_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT21 - Video Stabilization Contrast 21 Register.
#define ISPOST_VSCT21_OFFSET                   (0x01A8)
#define ISPOST_VSCT21                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT21_OFFSET)

/*
 * ISPOST, VSCT21, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT21_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT21_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT21_X_SHIFT                  (16)
#define ISPOST_VSCT21_X_LENGTH                 (16)
#define ISPOST_VSCT21_X_DEFAULT                (0)
#define ISPOST_VSCT21_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT21, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT21_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT21_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT21_Y_SHIFT                  (0)
#define ISPOST_VSCT21_Y_LENGTH                 (16)
#define ISPOST_VSCT21_Y_DEFAULT                (0)
#define ISPOST_VSCT21_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT31 - Video Stabilization Contrast 31 Register.
#define ISPOST_VSCT31_OFFSET                   (0x01AC)
#define ISPOST_VSCT31                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT31_OFFSET)

