vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, VSCT31, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT31_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT31_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT31_X_SHIFT                  (16)
#define ISPOST_VSCT31_X_LENGTH                 (16)
#define ISPOST_VSCT31_X_DEFAULT                (0)
#define ISPOST_VSCT31_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT31, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT31_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT31_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT31_Y_SHIFT                  (0)
#define ISPOST_VSCT31_Y_LENGTH                 (16)
#define ISPOST_VSCT31_Y_DEFAULT                (0)
#define ISPOST_VSCT31_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT02 - Video Stabilization Contrast 02 Register.
#define ISPOST_VSCT02_OFFSET                   (0x01B0)
#define ISPOST_VSCT02                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT02_OFFSET)

/*
 * ISPOST, VSCT02, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT02_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT02_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT02_X_SHIFT                  (16)
#define ISPOST_VSCT02_X_LENGTH                 (16)
#define ISPOST_VSCT02_X_DEFAULT                (0)
#define ISPOST_VSCT02_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT02, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT02_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT02_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT02_Y_SHIFT                  (0)
#define ISPOST_VSCT02_Y_LENGTH                 (16)
#define ISPOST_VSCT02_Y_DEFAULT                (0)
#define ISPOST_VSCT02_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT12 - Video Stabilization Contrast 12 Register.
#define ISPOST_VSCT12_OFFSET                   (0x01B4)
#define ISPOST_VSCT12                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT12_OFFSET)

/*
 * ISPOST, VSCT12, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT12_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT12_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT12_X_SHIFT                  (16)
#define ISPOST_VSCT12_X_LENGTH                 (16)
#define ISPOST_VSCT12_X_DEFAULT                (0)
#define ISPOST_VSCT12_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT12, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT12_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT12_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT12_Y_SHIFT                  (0)
#define ISPOST_VSCT12_Y_LENGTH                 (16)
#define ISPOST_VSCT12_Y_DEFAULT                (0)
#define ISPOST_VSCT12_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT22 - Video Stabilization Contrast 22 Register.
#define ISPOST_VSCT22_OFFSET                   (0x01B8)
#define ISPOST_VSCT22                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT22_OFFSET)

/*
 * ISPOST, VSCT22, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT22_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT22_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT22_X_SHIFT                  (16)
#define ISPOST_VSCT22_X_LENGTH                 (16)
#define ISPOST_VSCT22_X_DEFAULT                (0)
#define ISPOST_VSCT22_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT22, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT22_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT22_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT22_Y_SHIFT                  (0)
#define ISPOST_VSCT22_Y_LENGTH                 (16)
#define ISPOST_VSCT22_Y_DEFAULT                (0)
#define ISPOST_VSCT22_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSCT32 - Video Stabilization Contrast 32 Register.
#define ISPOST_VSCT32_OFFSET                   (0x01BC)
#define ISPOST_VSCT32                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSCT32_OFFSET)

/*
 * ISPOST, VSCT32, X
 * [31:16] X - Contrast measure X coordinate.
 */
#define ISPOST_VSCT32_X_MASK                   (0xFFFF0000)
#define ISPOST_VSCT32_X_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT32_X_SHIFT                  (16)
#define ISPOST_VSCT32_X_LENGTH                 (16)
#define ISPOST_VSCT32_X_DEFAULT                (0)
#define ISPOST_VSCT32_X_SIGNED_FIELD           (0)

/*
 * ISPOST, VSCT32, Y
 * [15:0] Y - Contrast measure Y coordinate.
 */
#define ISPOST_VSCT32_Y_MASK                   (0x0000FFFF)
#define ISPOST_VSCT32_Y_LSBMASK                (0x0000FFFF)
#define ISPOST_VSCT32_Y_SHIFT                  (0)
#define ISPOST_VSCT32_Y_LENGTH                 (16)
#define ISPOST_VSCT32_Y_DEFAULT                (0)
#define ISPOST_VSCT32_Y_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSSIDX - Video Stabilization Curve Access Index Register.
#define ISPOST_VSSIDX_OFFSET                   (0x01C0)
#define ISPOST_VSSIDX                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSSIDX_OFFSET)

/*
 * ISPOST, VSSIDX, CRDMD
 * [19:18] CRDMD - Contrast read mode.
 *                 VSCT00 – VSCT32 register RD mode.
 *                 00 : X,Y.
 *                      (16 bits, 16 bits with saturation)
 *                 01 : X.
 *                      (24 bits)
 *                 10 : Y.
 *                      (24 bits)
 *                 11 : Reserved
 */
#define ISPOST_VSSIDX_CRDMD_MASK               (0x000C0000)
#define ISPOST_VSSIDX_CRDMD_LSBMASK            (0x00000003)
#define ISPOST_VSSIDX_CRDMD_SHIFT              (18)
#define ISPOST_VSSIDX_CRDMD_LENGTH             (2)
#define ISPOST_VSSIDX_CRDMD_DEFAULT            (0)
#define ISPOST_VSSIDX_CRDMD_SIGNED_FIELD       (0)

