vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, VSSIDX, SAINC
 * [17] SAINC - Automatically increment index VSSIDX[IDX] on VSSACC read.
 */
#define ISPOST_VSSIDX_SAINC_MASK               (0x00020000)
#define ISPOST_VSSIDX_SAINC_LSBMASK            (0x00000001)
#define ISPOST_VSSIDX_SAINC_SHIFT              (17)
#define ISPOST_VSSIDX_SAINC_LENGTH             (1)
#define ISPOST_VSSIDX_SAINC_DEFAULT            (0)
#define ISPOST_VSSIDX_SAINC_SIGNED_FIELD       (0)

/*
 * ISPOST, VSSIDX, SADAINC
 * [16] SADAINC - Automatically increment index VSSIDX[IDX] on VSCYSADACC read.
 */
#define ISPOST_VSSIDX_SADAINC_MASK             (0x00010000)
#define ISPOST_VSSIDX_SADAINC_LSBMASK          (0x00000001)
#define ISPOST_VSSIDX_SADAINC_SHIFT            (16)
#define ISPOST_VSSIDX_SADAINC_LENGTH           (1)
#define ISPOST_VSSIDX_SADAINC_DEFAULT          (0)
#define ISPOST_VSSIDX_SADAINC_SIGNED_FIELD     (0)

/*
 * ISPOST, VSSIDX, XBLOCKIDX
 * [13:12] XBLOCKIDX - The X Block index for the Signature and SAD curves to be read.
 *                     Valid XBLOCKIDX values: 0-3.
 */
#define ISPOST_VSSIDX_XBLOCKIDX_MASK           (0x00003000)
#define ISPOST_VSSIDX_XBLOCKIDX_LSBMASK        (0x00000003)
#define ISPOST_VSSIDX_XBLOCKIDX_SHIFT          (12)
#define ISPOST_VSSIDX_XBLOCKIDX_LENGTH         (2)
#define ISPOST_VSSIDX_XBLOCKIDX_DEFAULT        (0)
#define ISPOST_VSSIDX_XBLOCKIDX_SIGNED_FIELD   (0)

/*
 * ISPOST, VSSIDX, YBLOCKIDX
 * [9:8] YBLOCKIDX - The Y Block index for the Signature and SAD curves to be read.
 *                   Valid XBLOCKIDX values: 0-2.
 */
#define ISPOST_VSSIDX_YBLOCKIDX_MASK           (0x00000300)
#define ISPOST_VSSIDX_YBLOCKIDX_LSBMASK        (0x00000003)
#define ISPOST_VSSIDX_YBLOCKIDX_SHIFT          (8)
#define ISPOST_VSSIDX_YBLOCKIDX_LENGTH         (2)
#define ISPOST_VSSIDX_YBLOCKIDX_DEFAULT        (0)
#define ISPOST_VSSIDX_YBLOCKIDX_SIGNED_FIELD   (0)

/*
 * ISPOST, VSSIDX, IDX
 * [7:0] IDX - Signature and SAD curves index.
 *             SAD index will be automatically increased one after CPU read both of the CXSAD[index] and the CYSAD[index], i.e. 1C8h and 1CCh.
 *             CPU read data as follows : CXSAD[index] , CYSAD[index], CXSAD[index+1] , CYSAD[index+1], CXSAD[index+2], CYSAD[index+2],......,CXSAD[index+n] , CYSAD[index+n], ......., etc.
 */
#define ISPOST_VSSIDX_IDX_MASK                 (0x000000FF)
#define ISPOST_VSSIDX_IDX_LSBMASK              (0x000000FF)
#define ISPOST_VSSIDX_IDX_SHIFT                (0)
#define ISPOST_VSSIDX_IDX_LENGTH               (8)
#define ISPOST_VSSIDX_IDX_DEFAULT              (0)
#define ISPOST_VSSIDX_IDX_SIGNED_FIELD         (0)


//----------------------------------------------------------
// VSSACC - Video Stabilization Signature Curve Access Data Register.
#define ISPOST_VSSACC_OFFSET                   (0x01C4)
#define ISPOST_VSSACC                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSSACC_OFFSET)

/*
 * ISPOST, VSSACC, CYSC
 * [31:16] CYSC - Cy Signature curve data.
 *                This register is indexed by VSSIDX[IDX] and VSSIDX[XBLOCKIDX,YBLOCKIDX] (1C0H).
 *                Valid IDX index values: 0-159.
 *                Valid XBLOCKIDX index values : 0-3.
 *                Valid YBLOCKIDX index values : 0-2.
 */
#define ISPOST_VSSACC_CYSC_MASK                (0xFFFF0000)
#define ISPOST_VSSACC_CYSC_LSBMASK             (0x0000FFFF)
#define ISPOST_VSSACC_CYSC_SHIFT               (16)
#define ISPOST_VSSACC_CYSC_LENGTH              (16)
#define ISPOST_VSSACC_CYSC_DEFAULT             (0)
#define ISPOST_VSSACC_CYSC_SIGNED_FIELD        (0)

/*
 * ISPOST, VSSACC, CXSC
 * [15:0] CXSC - Cx Signature curve data.
 *               This register is indexed by VSSIDX[IDX] and VSSIDX[XBLOCKIDX,YBLOCKIDX] (1C0H).
 *               Valid IDX index values: 0-159.
 *               Valid XBLOCKIDX index values : 0-3.
 *               Valid YBLOCKIDX index values : 0-2.
 */
#define ISPOST_VSSACC_CXSC_MASK                (0x0000FFFF)
#define ISPOST_VSSACC_CXSC_LSBMASK             (0x0000FFFF)
#define ISPOST_VSSACC_CXSC_SHIFT               (0)
#define ISPOST_VSSACC_CXSC_LENGTH              (16)
#define ISPOST_VSSACC_CXSC_DEFAULT             (0)
#define ISPOST_VSSACC_CXSC_SIGNED_FIELD        (0)


//----------------------------------------------------------
// VSCXSADACC - Video Stabilization SAD Access Data Register.
#define ISPOST_VSCXSADACC_OFFSET               (0x01C8)
#define ISPOST_VSCXSADACC                      (ISPOST_PERI_BASE_ADDR + ISPOST_VSCXSADACC_OFFSET)

/*
 * ISPOST, VSCXSADACC, CXSAD
 * [31:0] CXSAD - SAD curve data for CX component.
 *                This register is indexed by VSSIDX[IDX] and VSSIDX[XBLOCKIDX,YBLOCKIDX] (1C0H).
 *                Valid IDX index values: 0-97.
 *                Valid XBLOCKIDX index values : 0-3.
 *                Valid YBLOCKIDX index values : 0-2.
 */
#define ISPOST_VSCXSADACC_CXSAD_MASK           (0xFFFFFFFF)
#define ISPOST_VSCXSADACC_CXSAD_LSBMASK        (0xFFFFFFFF)
#define ISPOST_VSCXSADACC_CXSAD_SHIFT          (0)
#define ISPOST_VSCXSADACC_CXSAD_LENGTH         (32)
#define ISPOST_VSCXSADACC_CXSAD_DEFAULT        (0)
#define ISPOST_VSCXSADACC_CXSAD_SIGNED_FIELD   (0)


//----------------------------------------------------------
// VSCYSADACC - Video Stabilization SAD Access Data Register.
#define ISPOST_VSCYSADACC_OFFSET               (0x01CC)
#define ISPOST_VSCYSADACC                      (ISPOST_PERI_BASE_ADDR + ISPOST_VSCYSADACC_OFFSET)

/*
 * ISPOST, VSCYSADACC, CYSAD
 * [31:0] CYSAD - SAD curve data for CY component.
 *                This register is indexed by VSSIDX[IDX] and VSSIDX[XBLOCKIDX,YBLOCKIDX] (1C0H).
 *                Valid IDX index values: 0-97.
 *                Valid XBLOCKIDX index values : 0-3.
 *                Valid YBLOCKIDX index values : 0-2.
 */
#define ISPOST_VSCYSADACC_CYSAD_MASK           (0xFFFFFFFF)
#define ISPOST_VSCYSADACC_CYSAD_LSBMASK        (0xFFFFFFFF)
#define ISPOST_VSCYSADACC_CYSAD_SHIFT          (0)
#define ISPOST_VSCYSADACC_CYSAD_LENGTH         (32)
#define ISPOST_VSCYSADACC_CYSAD_DEFAULT        (0)
#define ISPOST_VSCYSADACC_CYSAD_SIGNED_FIELD   (0)


//----------------------------------------------------------
// VSRCAY - VS Source Image Y Plane Start Address Register.
#define ISPOST_VSRCAY_OFFSET                   (0x0208)
#define ISPOST_VSRCAY                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSRCAY_OFFSET)

