vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, VSRCAY, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_VSRCAY_SAD_MASK                 (0xFFFFFFF8)
#define ISPOST_VSRCAY_SAD_LSBMASK              (0xFFFFFFF8)
#define ISPOST_VSRCAY_SAD_SHIFT                (0)
#define ISPOST_VSRCAY_SAD_LENGTH               (32)
#define ISPOST_VSRCAY_SAD_DEFAULT              (0)
#define ISPOST_VSRCAY_SAD_SIGNED_FIELD         (0)


//----------------------------------------------------------
// VSRCAUV - VS Source Image UV Plane Start Address Register.
#define ISPOST_VSRCAUV_OFFSET                  (0x0210)
#define ISPOST_VSRCAUV                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSRCAUV_OFFSET)

/*
 * ISPOST, VSRCAUV, SAD
 * [31:3] SAD - Base address in QWORD (64bit) boundary.
 */
#define ISPOST_VSRCAUV_SAD_MASK                (0xFFFFFFF8)
#define ISPOST_VSRCAUV_SAD_LSBMASK             (0xFFFFFFF8)
#define ISPOST_VSRCAUV_SAD_SHIFT               (0)
#define ISPOST_VSRCAUV_SAD_LENGTH              (32)
#define ISPOST_VSRCAUV_SAD_DEFAULT             (0)
#define ISPOST_VSRCAUV_SAD_SIGNED_FIELD        (0)


//----------------------------------------------------------
// VSRCS - VS Source Image Stride Register.
#define ISPOST_VSRCS_OFFSET                    (0x0214)
#define ISPOST_VSRCS                           (ISPOST_PERI_BASE_ADDR + ISPOST_VSRCS_OFFSET)

/*
 * ISPOST, VSRCS, SD
 * [12:3] SD - Image stride (QWORD granularity).
 */
#define ISPOST_VSRCS_SD_MASK                   (0x00001FF8)
#define ISPOST_VSRCS_SD_LSBMASK                (0x00001FF8)
#define ISPOST_VSRCS_SD_SHIFT                  (0)
#define ISPOST_VSRCS_SD_LENGTH                 (13)
#define ISPOST_VSRCS_SD_DEFAULT                (0)
#define ISPOST_VSRCS_SD_SIGNED_FIELD           (0)


//----------------------------------------------------------
// VSRSZ - VS Source Image Size Register.
#define ISPOST_VSRSZ_OFFSET                    (0x0218)
#define ISPOST_VSRSZ                           (ISPOST_PERI_BASE_ADDR + ISPOST_VSRSZ_OFFSET)

/*
 * ISPOST, VSRSZ, W
 * [28:16] W - Source image width (pixel granularity).
 */
#define ISPOST_VSRSZ_W_MASK                    (0x1FFF0000)
#define ISPOST_VSRSZ_W_LSBMASK                 (0x00001FFF)
#define ISPOST_VSRSZ_W_SHIFT                   (16)
#define ISPOST_VSRSZ_W_LENGTH                  (13)
#define ISPOST_VSRSZ_W_DEFAULT                 (0)
#define ISPOST_VSRSZ_W_SIGNED_FIELD            (0)

/*
 * ISPOST, VSRSZ, H
 * [12:0] H - Source image height (line granularity).
 */
#define ISPOST_VSRSZ_H_MASK                    (0x00001FFF)
#define ISPOST_VSRSZ_H_LSBMASK                 (0x00001FFF)
#define ISPOST_VSRSZ_H_SHIFT                   (0)
#define ISPOST_VSRSZ_H_LENGTH                  (13)
#define ISPOST_VSRSZ_H_DEFAULT                 (0)
#define ISPOST_VSRSZ_H_SIGNED_FIELD            (0)


//----------------------------------------------------------
// VSROFF - VS Registration Offset, Rolling Shutter Coeff Register.
#define ISPOST_VSROFF_OFFSET                   (0x021C)
#define ISPOST_VSROFF                          (ISPOST_PERI_BASE_ADDR + ISPOST_VSROFF_OFFSET)

/*
 * ISPOST, VSROFF, ROLL
 * [29:16] ROLL - Rolling shutter correction factor – signed value (format 1.1.12) See figure below.
 */
#define ISPOST_VSROFF_ROLL_MASK                (0x3FFF0000)
#define ISPOST_VSROFF_ROLL_LSBMASK             (0x00003FFF)
#define ISPOST_VSROFF_ROLL_SHIFT               (16)
#define ISPOST_VSROFF_ROLL_LENGTH              (14)
#define ISPOST_VSROFF_ROLL_DEFAULT             (0)
#define ISPOST_VSROFF_ROLL_SIGNED_FIELD        (0)

/*
 * ISPOST, VSROFF, HOFF
 * [12:0] HOFF - Horizontal registration offset (pixel granularity). See figure below.
 */
#define ISPOST_VSROFF_HOFF_MASK                (0x00001FFF)
#define ISPOST_VSROFF_HOFF_LSBMASK             (0x00001FFF)
#define ISPOST_VSROFF_HOFF_SHIFT               (0)
#define ISPOST_VSROFF_HOFF_LENGTH              (13)
#define ISPOST_VSROFF_HOFF_DEFAULT             (0)
#define ISPOST_VSROFF_HOFF_SIGNED_FIELD        (0)


//----------------------------------------------------------
// VSRVOFF - VS Registration Vertical Offset Register.
#define ISPOST_VSRVOFF_OFFSET                  (0x0220)
#define ISPOST_VSRVOFF                         (ISPOST_PERI_BASE_ADDR + ISPOST_VSRVOFF_OFFSET)

/*
 * ISPOST, VSRVOFF, VOFF
 * [0] VOFF - Vertical registration offset (line granularity).
 *            Majority of vertical offset is provided by start address adjustment.
 *            For 4:2:0 formats where UV granularity provided by address adjustment would be 2 lines the VOFF provides 1 line offset.
 */
#define ISPOST_VSRVOFF_VOFF_MASK               (0x00000001)
#define ISPOST_VSRVOFF_VOFF_LSBMASK            (0x00000001)
#define ISPOST_VSRVOFF_VOFF_SHIFT              (0)
#define ISPOST_VSRVOFF_VOFF_LENGTH             (1)
#define ISPOST_VSRVOFF_VOFF_DEFAULT            (0)
#define ISPOST_VSRVOFF_VOFF_SIGNED_FIELD       (0)


//----------------------------------------------------------
// VSAXI - VS AXI ID Register.
#define ISPOST_VSAXI_OFFSET                    (0x0224)
#define ISPOST_VSAXI                           (ISPOST_PERI_BASE_ADDR + ISPOST_VSAXI_OFFSET)

/*
 * ISPOST, VSAXI, FWID
 * [15:8] FWID - FWID VS Frame write AXI Write ID.
 */
#define ISPOST_VSAXI_FWID_MASK                 (0x0000FF00)
#define ISPOST_VSAXI_FWID_LSBMASK              (0x000000FF)
#define ISPOST_VSAXI_FWID_SHIFT                (8)
#define ISPOST_VSAXI_FWID_LENGTH               (8)
#define ISPOST_VSAXI_FWID_DEFAULT              (0)
#define ISPOST_VSAXI_FWID_SIGNED_FIELD         (0)

/*
 * ISPOST, VSAXI, RDID
 * [7:0] RDID - RDID VS Image registration AXI Read ID.
 */
#define ISPOST_VSAXI_RDID_MASK                 (0x000000FF)
#define ISPOST_VSAXI_RDID_LSBMASK              (0x000000FF)
#define ISPOST_VSAXI_RDID_SHIFT                (0)
#define ISPOST_VSAXI_RDID_LENGTH               (8)
#define ISPOST_VSAXI_RDID_DEFAULT              (0)
#define ISPOST_VSAXI_RDID_SIGNED_FIELD         (0)



//==========================================================
// Video link registers offset.
//----------------------------------------------------------
// VLINK - Video Link Control Register.
#define ISPOST_VLINK_OFFSET                    (0x0240)
#define ISPOST_VLINK                           (ISPOST_PERI_BASE_ADDR + ISPOST_VLINK_OFFSET)

