vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, VLINK, CTRL
 * [31:0] CTRL - Control value.
 *               Default value: 00000001H
 */
#define ISPOST_VLINK_CTRL_MASK                 (0xFFFFFFFF)
#define ISPOST_VLINK_CTRL_LSBMASK              (0xFFFFFFFF)
#define ISPOST_VLINK_CTRL_SHIFT                (0)
#define ISPOST_VLINK_CTRL_LENGTH               (32)
#define ISPOST_VLINK_CTRL_DEFAULT              (0)
#define ISPOST_VLINK_CTRL_SIGNED_FIELD         (0)

/*
 * ISPOST, VLINK, RSRV
 * [31:12] RSRV - Reserved - Future debugging use.
 */
#define ISPOST_VLINK_RSRV_MASK                 (0xFFFFF000)
#define ISPOST_VLINK_RSRV_LSBMASK              (0x000FFFFF)
#define ISPOST_VLINK_RSRV_SHIFT                (12)
#define ISPOST_VLINK_RSRV_LENGTH               (20)
#define ISPOST_VLINK_RSRV_DEFAULT              (0)
#define ISPOST_VLINK_RSRV_SIGNED_FIELD         (0)

/*
 * ISPOST, VLINK, DATA_SELECT
 * [11] DATA_SELECT - The bit specifies the vlink input data coming from scaler 0 or unscaled output.
 *                    0: means unscaled output.
 *                    1: means scaler 0.
 */
#define ISPOST_VLINK_DATA_SELECT_MASK          (0x00000800)
#define ISPOST_VLINK_DATA_SELECT_LSBMASK       (0x00000001)
#define ISPOST_VLINK_DATA_SELECT_SHIFT         (11)
#define ISPOST_VLINK_DATA_SELECT_LENGTH        (1)
#define ISPOST_VLINK_DATA_SELECT_DEFAULT       (0)
#define ISPOST_VLINK_DATA_SELECT_SIGNED_FIELD  (0)

/*
 * ISPOST, VLINK, CMD_FIFO_THRESHOLD
 * [10:6] CMD_FIFO_THRESHOLD - Command FIFO threshold.
 */
#define ISPOST_VLINK_CMD_FIFO_THRESHOLD_MASK         (0x000007C0)
#define ISPOST_VLINK_CMD_FIFO_THRESHOLD_LSBMASK      (0x0000001F)
#define ISPOST_VLINK_CMD_FIFO_THRESHOLD_SHIFT        (6)
#define ISPOST_VLINK_CMD_FIFO_THRESHOLD_LENGTH       (5)
#define ISPOST_VLINK_CMD_FIFO_THRESHOLD_DEFAULT      (0)
#define ISPOST_VLINK_CMD_FIFO_THRESHOLD_SIGNED_FIELD (0)

/*
 * ISPOST, VLINK, HMB
 * [5] HMB - The bit specifies the image height can be divided by 16 (MB height) or not. One means yes.
 *           0 : Can not be divided by 16.
 *           1 : Can be divided by 16.
 */
#define ISPOST_VLINK_HMB_MASK                  (0x00000020)
#define ISPOST_VLINK_HMB_LSBMASK               (0x00000001)
#define ISPOST_VLINK_HMB_SHIFT                 (5)
#define ISPOST_VLINK_HMB_LENGTH                (1)
#define ISPOST_VLINK_HMB_DEFAULT               (0)
#define ISPOST_VLINK_HMB_SIGNED_FIELD          (0)

/*
 * ISPOST, VLINK, FIFO_THRESHOLD
 * [4:0] FIFO_THRESHOLD - Data FIFO threshold. 
 *                        Default value: 00000001H
 */
#define ISPOST_VLINK_FIFO_THRESHOLD_MASK         (0x0000001F)
#define ISPOST_VLINK_FIFO_THRESHOLD_LSBMASK      (0x0000001F)
#define ISPOST_VLINK_FIFO_THRESHOLD_SHIFT        (0)
#define ISPOST_VLINK_FIFO_THRESHOLD_LENGTH       (5)
#define ISPOST_VLINK_FIFO_THRESHOLD_DEFAULT      (0)
#define ISPOST_VLINK_FIFO_THRESHOLD_SIGNED_FIELD (0)


//----------------------------------------------------------
// VLINKSA - Start Address Register.
#define ISPOST_VLINKSA_OFFSET                  (0x0244)
#define ISPOST_VLINKSA                         (ISPOST_PERI_BASE_ADDR + ISPOST_VLINKSA_OFFSET)

/*
 * ISPOST, VLINKSA, SAD
 * [31:3] SAD - Luminance plane base address in QWORD (64bit) boundary.
 *              Chrominance plane must directly follow the luminance plane.
 */
#define ISPOST_VLINKSA_SAD_MASK                (0xFFFFFFF8)
#define ISPOST_VLINKSA_SAD_LSBMASK             (0xFFFFFFF8)
#define ISPOST_VLINKSA_SAD_SHIFT               (0)
#define ISPOST_VLINKSA_SAD_LENGTH              (32)
#define ISPOST_VLINKSA_SAD_DEFAULT             (0)
#define ISPOST_VLINKSA_SAD_SIGNED_FIELD        (0)


//----------------------------------------------------------
// ILINKSAM - ISP Link Start Address MSW Register.
#define ISPOST_ILINKSAM_OFFSET                 (0x0250)
#define ISPOST_ILINKSAM                        (ISPOST_PERI_BASE_ADDR + ISPOST_ILINKSAM_OFFSET)

/*
 * ISPOST, ILINKSAM, SADM
 * [7:0] SADM - ISP Link start address bits [39:32].
 */
#define ISPOST_ILINKSAM_SADM_MASK              (0x000000FF)
#define ISPOST_ILINKSAM_SADM_LSBMASK           (0x000000FF)
#define ISPOST_ILINKSAM_SADM_SHIFT             (0)
#define ISPOST_ILINKSAM_SADM_LENGTH            (8)
#define ISPOST_ILINKSAM_SADM_DEFAULT           (0)
#define ISPOST_ILINKSAM_SADM_SIGNED_FIELD      (0)


//----------------------------------------------------------
// ILINKSAL - ISP Link Start Address LSW Register.
#define ISPOST_ILINKSAL_OFFSET                 (0x0254)
#define ISPOST_ILINKSAL                        (ISPOST_PERI_BASE_ADDR + ISPOST_ILINKSAL_OFFSET)

/*
 * ISPOST, ILINKSAL, SADL
 * [31:4] SADL - ISP Link start address bits [31:4].
 */
#define ISPOST_ILINKSAL_SADL_MASK              (0xFFFFFFF0)
#define ISPOST_ILINKSAL_SADL_LSBMASK           (0xFFFFFFF0)
#define ISPOST_ILINKSAL_SADL_SHIFT             (0)
#define ISPOST_ILINKSAL_SADL_LENGTH            (32)
#define ISPOST_ILINKSAL_SADL_DEFAULT           (0)
#define ISPOST_ILINKSAL_SADL_SIGNED_FIELD      (0)


//----------------------------------------------------------
// ILINKCTRL0 - ISP Link Control Register 0.
#define ISPOST_ILINKCTRL0_OFFSET               (0x0258)
#define ISPOST_ILINKCTRL0                      (ISPOST_PERI_BASE_ADDR + ISPOST_ILINKCTRL0_OFFSET)

/*
 * ISPOST, ILINKCTRL0, CTRL
 * [31:0] CTRL - Control value.
 */
#define ISPOST_ILINKCTRL0_CTRL_MASK            (0xFFFFFFFF)
#define ISPOST_ILINKCTRL0_CTRL_LSBMASK         (0xFFFFFFFF)
#define ISPOST_ILINKCTRL0_CTRL_SHIFT           (0)
#define ISPOST_ILINKCTRL0_CTRL_LENGTH          (32)
#define ISPOST_ILINKCTRL0_CTRL_DEFAULT         (0)
#define ISPOST_ILINKCTRL0_CTRL_SIGNED_FIELD    (0)


//----------------------------------------------------------
// ILINKCTRL1 - ISP Link Control Register 1.
#define ISPOST_ILINKCTRL1_OFFSET               (0x025C)
#define ISPOST_ILINKCTRL1                      (ISPOST_PERI_BASE_ADDR + ISPOST_ILINKCTRL1_OFFSET)

/*
 * ISPOST, ILINKCTRL1, CTRL
 * [31:0] CTRL - Control value.
 */
#define ISPOST_ILINKCTRL1_CTRL_MASK            (0xFFFFFFFF)
#define ISPOST_ILINKCTRL1_CTRL_LSBMASK         (0xFFFFFFFF)
#define ISPOST_ILINKCTRL1_CTRL_SHIFT           (0)
#define ISPOST_ILINKCTRL1_CTRL_LENGTH          (32)
#define ISPOST_ILINKCTRL1_CTRL_DEFAULT         (0)
#define ISPOST_ILINKCTRL1_CTRL_SIGNED_FIELD    (0)

