vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
/*
 * ISPOST, ILINKCTRL1, INV
 * [31] INV - invert ISP address (enable link).
 */
#define ISPOST_ILINKCTRL1_INV_MASK             (0x80000000)
#define ISPOST_ILINKCTRL1_INV_LSBMASK          (0x00000001)
#define ISPOST_ILINKCTRL1_INV_SHIFT            (31)
#define ISPOST_ILINKCTRL1_INV_LENGTH           (1)
#define ISPOST_ILINKCTRL1_INV_DEFAULT          (0)
#define ISPOST_ILINKCTRL1_INV_SIGNED_FIELD     (0)

/*
 * ISPOST, ILINKCTRL1, BURST4W
 * [30] BURST4W - pad all bursts to 4w.
 */
#define ISPOST_ILINKCTRL1_BURST4W_MASK         (0x40000000)
#define ISPOST_ILINKCTRL1_BURST4W_LSBMASK      (0x00000001)
#define ISPOST_ILINKCTRL1_BURST4W_SHIFT        (30)
#define ISPOST_ILINKCTRL1_BURST4W_LENGTH       (1)
#define ISPOST_ILINKCTRL1_BURST4W_DEFAULT      (0)
#define ISPOST_ILINKCTRL1_BURST4W_SIGNED_FIELD (0)

/*
 * ISPOST, ILINKCTRL1, ENBURST
 * [29] ENBURST - insert bursts enable.
 */
#define ISPOST_ILINKCTRL1_ENBURST_MASK         (0x20000000)
#define ISPOST_ILINKCTRL1_ENBURST_LSBMASK      (0x00000001)
#define ISPOST_ILINKCTRL1_ENBURST_SHIFT        (29)
#define ISPOST_ILINKCTRL1_ENBURST_LENGTH       (1)
#define ISPOST_ILINKCTRL1_ENBURST_DEFAULT      (0)
#define ISPOST_ILINKCTRL1_ENBURST_SIGNED_FIELD (0)

/*
 * ISPOST, ILINKCTRL1, ENREC
 * [28] ENREC - reorder enable.
 */
#define ISPOST_ILINKCTRL1_ENREC_MASK           (0x10000000)
#define ISPOST_ILINKCTRL1_ENREC_LSBMASK        (0x00000001)
#define ISPOST_ILINKCTRL1_ENREC_SHIFT          (28)
#define ISPOST_ILINKCTRL1_ENREC_LENGTH         (1)
#define ISPOST_ILINKCTRL1_ENREC_DEFAULT        (0)
#define ISPOST_ILINKCTRL1_ENREC_SIGNED_FIELD   (0)

/*
 * ISPOST, ILINKCTRL1, RSLAST
 * [23:16] RSLAST - reorder sequence last, set bit to 1 for last sel0, sel1 in burst sequence.
 */
#define ISPOST_ILINKCTRL1_RSLAST_MASK          (0x00FF0000)
#define ISPOST_ILINKCTRL1_RSLAST_LSBMASK       (0x000000FF)
#define ISPOST_ILINKCTRL1_RSLAST_SHIFT         (16)
#define ISPOST_ILINKCTRL1_RSLAST_LENGTH        (8)
#define ISPOST_ILINKCTRL1_RSLAST_DEFAULT       (0)
#define ISPOST_ILINKCTRL1_RSLAST_SIGNED_FIELD  (0)

/*
 * ISPOST, ILINKCTRL1, RSSEL1
 * [15:8] RSSEL1 - reorder sequence sel1.
 *                 Y0: {sel1,sel0}=00, Y1: {sel1,sel0}=01, UV: {sel1,sel0}=10.
 *                 For YUV420: ISP burst sequence: UV, Y0, Y1(last)
 */
#define ISPOST_ILINKCTRL1_RSSEL1_MASK          (0x0000FF00)
#define ISPOST_ILINKCTRL1_RSSEL1_LSBMASK       (0x000000FF)
#define ISPOST_ILINKCTRL1_RSSEL1_SHIFT         (8)
#define ISPOST_ILINKCTRL1_RSSEL1_LENGTH        (8)
#define ISPOST_ILINKCTRL1_RSSEL1_DEFAULT       (0)
#define ISPOST_ILINKCTRL1_RSSEL1_SIGNED_FIELD  (0)

/*
 * ISPOST, ILINKCTRL1, RSSEL0
 * [7:0] RSSEL0 - reorder sequence sel0.
 *                Y0: {sel1,sel0}=00, Y1: {sel1,sel0}=01, UV: {sel1,sel0}=10.
 *                For YUV420: ISP burst sequence: UV, Y0, Y1(last)
 */
#define ISPOST_ILINKCTRL1_RSSEL0_MASK          (0x000000FF)
#define ISPOST_ILINKCTRL1_RSSEL0_LSBMASK       (0x000000FF)
#define ISPOST_ILINKCTRL1_RSSEL0_SHIFT         (0)
#define ISPOST_ILINKCTRL1_RSSEL0_LENGTH        (8)
#define ISPOST_ILINKCTRL1_RSSEL0_DEFAULT       (0)
#define ISPOST_ILINKCTRL1_RSSEL0_SIGNED_FIELD  (0)


//----------------------------------------------------------
// ILINKSTAT0 - ISP Link Status Register 0.
#define ISPOST_ILINKSTAT0_OFFSET               (0x0260)
#define ISPOST_ILINKSTAT0                      (ISPOST_PERI_BASE_ADDR + ISPOST_ILINKSTAT0_OFFSET)

/*
 * ISPOST, ILINKSTAT0, STAT
 * [31:0] STAT - Status value.
 */
#define ISPOST_ILINKSTAT0_STAT_MASK            (0xFFFFFFFF)
#define ISPOST_ILINKSTAT0_STAT_LSBMASK         (0xFFFFFFFF)
#define ISPOST_ILINKSTAT0_STAT_SHIFT           (0)
#define ISPOST_ILINKSTAT0_STAT_LENGTH          (32)
#define ISPOST_ILINKSTAT0_STAT_DEFAULT         (0)
#define ISPOST_ILINKSTAT0_STAT_SIGNED_FIELD    (0)


//----------------------------------------------------------
// ILINKCTRL2 - ISP Link Control Register 2.
#define ISPOST_ILINKCTRL2_OFFSET               (0x0264)
#define ISPOST_ILINKCTRL2                      (ISPOST_PERI_BASE_ADDR + ISPOST_ILINKCTRL2_OFFSET)

/*
 * ISPOST, ILINKCTRL2, CTRL
 * [31:0] CTRL - Control value.
 */
#define ISPOST_ILINKCTRL2_CTRL_MASK            (0xFFFFFFFF)
#define ISPOST_ILINKCTRL2_CTRL_LSBMASK         (0xFFFFFFFF)
#define ISPOST_ILINKCTRL2_CTRL_SHIFT           (0)
#define ISPOST_ILINKCTRL2_CTRL_LENGTH          (32)
#define ISPOST_ILINKCTRL2_CTRL_DEFAULT         (0)
#define ISPOST_ILINKCTRL2_CTRL_SIGNED_FIELD    (0)

/*
 * ISPOST, ILINKCTRL2, BURSTL
 * [23:16] BURSTL - burst_insert_len - insert burst_insert_len 4word bursts.
 */
#define ISPOST_ILINKCTRL2_BURSTL_MASK          (0x00FF0000)
#define ISPOST_ILINKCTRL2_BURSTL_LSBMASK       (0x000000FF)
#define ISPOST_ILINKCTRL2_BURSTL_SHIFT         (16)
#define ISPOST_ILINKCTRL2_BURSTL_LENGTH        (8)
#define ISPOST_ILINKCTRL2_BURSTL_DEFAULT       (0)
#define ISPOST_ILINKCTRL2_BURSTL_SIGNED_FIELD  (0)

/*
 * ISPOST, ILINKCTRL2, BURSTW
 * [11:0] BURSTW - burst_insert_w - insert burst_insert_len 4word bursts after burst_insert_w input bursts.
 *                 For YUV 420: 3 bursts = 64 pixels.
 *                 For YUV 422: 2 bursts = 64 pixels.
 */
#define ISPOST_ILINKCTRL2_BURSTW_MASK          (0x00000FFF)
#define ISPOST_ILINKCTRL2_BURSTW_LSBMASK       (0x00000FFF)
#define ISPOST_ILINKCTRL2_BURSTW_SHIFT         (0)
#define ISPOST_ILINKCTRL2_BURSTW_LENGTH        (12)
#define ISPOST_ILINKCTRL2_BURSTW_DEFAULT       (0)
#define ISPOST_ILINKCTRL2_BURSTW_SIGNED_FIELD  (0)


//----------------------------------------------------------
// ILINKCTRL3 - ISP Link Control Register 3.
#define ISPOST_ILINKCTRL3_OFFSET               (0x0268)
#define ISPOST_ILINKCTRL3                      (ISPOST_PERI_BASE_ADDR + ISPOST_ILINKCTRL3_OFFSET)

/*
 * ISPOST, ILINKCTRL3, CTRL
 * [31:0] CTRL - Control value.
 */
#define ISPOST_ILINKCTRL3_CTRL_MASK            (0xFFFFFFFF)
#define ISPOST_ILINKCTRL3_CTRL_LSBMASK         (0xFFFFFFFF)
#define ISPOST_ILINKCTRL3_CTRL_SHIFT           (0)
#define ISPOST_ILINKCTRL3_CTRL_LENGTH          (32)
#define ISPOST_ILINKCTRL3_CTRL_DEFAULT         (0)
#define ISPOST_ILINKCTRL3_CTRL_SIGNED_FIELD    (0)



