vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
//==========================================================
//===== Dump Image to Memory Register =====
//----------------------------------------------------------
// Dump Image to Memory : Trigger Register.
#define ISPOST_DUMPTRIG_OFFSET                 (0x0100)
#define ISPOST_DUMPTRIG                        (ISPOST_PERI_BASE_ADDR + ISPOST_DUMPTRIG_OFFSET)

/*
 * ISPOST, FILEID, TR
 */
#define ISPOST_DUMPTRIG_TR_MASK                (0x00000002)
#define ISPOST_DUMPTRIG_TR_LSBMASK             (0x00000001)
#define ISPOST_DUMPTRIG_TR_SHIFT               (1)
#define ISPOST_DUMPTRIG_TR_LENGTH              (1)
#define ISPOST_DUMPTRIG_TR_DEFAULT             (0)
#define ISPOST_DUMPTRIG_TR_SIGNED_FIELD        (0)


//----------------------------------------------------------
// Dump Image to Memory : Start Address Register.
#define ISPOST_DUMPA_OFFSET                    (0x0104)
#define ISPOST_DUMPA                           (ISPOST_PERI_BASE_ADDR + ISPOST_DUMPA_OFFSET)

/*
 * ISPOST, DUMPA, SAD
 * [31:3] Base address in QWORD (64bit) boundary.
 */
#define ISPOST_DUMPA_SAD_MASK                  (0xFFFFFFF8)
#define ISPOST_DUMPA_SAD_LSBMASK               (0xFFFFFFF8)
#define ISPOST_DUMPA_SAD_SHIFT                 (0)
#define ISPOST_DUMPA_SAD_LENGTH                (32)
#define ISPOST_DUMPA_SAD_DEFAULT               (0)
#define ISPOST_DUMPA_SAD_SIGNED_FIELD          (0)


//----------------------------------------------------------
// Dump Image to Memory : File ID Register.
#define ISPOST_DUMPFID_OFFSET                  (0x0108)
#define ISPOST_DUMPFID                         (ISPOST_PERI_BASE_ADDR + ISPOST_DUMPFID_OFFSET)

/*
 * ISPOST, DUMPFID, ID
 */
#define ISPOST_DUMPFID_ID_MASK                  (0x0000000F)
#define ISPOST_DUMPFID_ID_LSBMASK               (0x0000000F)
#define ISPOST_DUMPFID_ID_SHIFT                 (0)
#define ISPOST_DUMPFID_ID_LENGTH                (4)
#define ISPOST_DUMPFID_ID_DEFAULT               (0)
#define ISPOST_DUMPFID_ID_SIGNED_FIELD          (0)

//----------------------------------------------------------
// Dump Image to Memory : Size Register.
#define ISPOST_DUMPSZ_OFFSET                   (0x010C)
#define ISPOST_DUMPSZ                          (ISPOST_PERI_BASE_ADDR + ISPOST_DUMPSZ_OFFSET)

/*
 * ISPOST, DUMPSZ, SZ
 */
#define ISPOST_DUMPSZ_SZ_MASK                  (0xFFFFFFFF)
#define ISPOST_DUMPSZ_SZ_LSBMASK               (0xFFFFFFFF)
#define ISPOST_DUMPSZ_SZ_SHIFT                 (0)
#define ISPOST_DUMPSZ_SZ_LENGTH                (32)
#define ISPOST_DUMPSZ_SZ_DEFAULT               (0)
#define ISPOST_DUMPSZ_SZ_SIGNED_FIELD          (0)
//===== Dump Image to Memory Register End =====


/*!
******************************************************************************

 @Macro	ISPOST_REGIO_READ_FIELD

 @Title     This macro is used to extract a field from a register.

 @Input		ui32RegValue: 		The register value.

 @Input		group: 		The name of the group containing the register from which
						the field is to be extracted.

 @Input		reg: 		The name of the register from which the field is to
						be extracted.

 @Input		field: 		The name of the field to be extracted.

 @Return	IMG_UINT32:	The value of the field - right aligned.

******************************************************************************/

#if 1
#define ISPOST_REGIO_READ_FIELD(ui32RegValue, group, reg, field)				\
	((ui32RegValue & group##_##reg##_##field##_MASK) >> group##_##reg##_##field##_SHIFT)

#else

#define ISPOST_REGIO_READ_FIELD(ui32RegValue, group, reg, field)				\
	((ui32RegValue >> group##_##reg##_##field##_SHIFT) & group##_##reg##_##field##_LSBMASK)

#endif

#if ( defined WIN32 || defined __linux__ ) && !defined NO_REGIO_CHECK_FIELD_VALUE
	/* Only provide register field range checking for Windows and Linux builds */

	/* Simple range check that ensures that if bits outside the valid field		*/
	/* range are set, that the provided value is at least consistent with a		*/
	/* negative value (i.e.: all top bits are set to 1).						*/

	/* Cannot perform more comprehensive testing without knowing whether field	*/
	/* should be interpreted as signed or unsigned.								*/

#ifdef IMG_KERNEL_MODULE
#define REG_PRINT(...) printk(KERN_DEBUG __VA_ARGS__)
#else
#define REG_PRINT printf
#endif

    #define ISPOST_REGIO_CHECK_VALUE_FITS_WITHIN_FIELD(This_Group,This_Reg,This_Field,This_Value) \
    { \
	if ( ((ISPOST_UINT32)(ISPOST_INT32)This_Value) > (This_Group##_##This_Reg##_##This_Field##_LSBMASK) && \
	     (((ISPOST_UINT32)(ISPOST_INT32)This_Value) & (ISPOST_UINT32)~(This_Group##_##This_Reg##_##This_Field##_LSBMASK)) !=  \
	     (ISPOST_UINT32)~(This_Group##_##This_Reg##_##This_Field##_LSBMASK) )		\
           { \
	       REG_PRINT("%s: %d does not fit in %s:%s:%s\n", __FUNCTION__, This_Value, #This_Group, #This_Reg, #This_Field); \
	   } \
    }

#else
	#define ISPOST_REGIO_CHECK_VALUE_FITS_WITHIN_FIELD(This_Group,This_Reg,This_Field,This_Value)
#endif

/*!
******************************************************************************

 @Macro	ISPOST_REGIO_WRITE_FIELD

 @Title     This macro is used to update the value of a field in a register.

 @Input		ui32RegValue: 	The register value - which gets updated.

 @Input		group: 		The name of the group containing the register into which
						the field is to be written.

 @Input		reg: 		The name of the register into which the field is to
						be written.

 @Input		field: 		The name of the field to be updated.

 @Input		ui32Value: 	The value to be written to the field - right aligned.

 @Return	None.

******************************************************************************/
#define ISPOST_REGIO_WRITE_FIELD(ui32RegValue, group, reg, field, ui32Value)									\
{																												\
	ISPOST_REGIO_CHECK_VALUE_FITS_WITHIN_FIELD(group,reg,field,ui32Value);										\
	(ui32RegValue) =																							\
	((ui32RegValue) & ~(group##_##reg##_##field##_MASK)) |														\
		(((ISPOST_UINT32) (ui32Value) << (group##_##reg##_##field##_SHIFT)) & (group##_##reg##_##field##_MASK));	\
}

/*!
******************************************************************************

 @Macro	ISPOST_REGIO_WRITE_FIELD_LITE

 @Title     This macro is used to update the value of a field in a register.

