vigoss30611/buildroot-ltc/kernel/drivers/infotm/apollo3/ispost/ci_ispost_reg.h
 @note      It assumes that ui32RegValue is initially zero and thus no masking is required.

 @Input		ui32RegValue: 	The register value - which gets updated.

 @Input		group: 		The name of the group containing the register into which
						the field is to be written.

 @Input		reg: 		The name of the register into which the field is to
						be written.

 @Input		field: 		The name of the field to be updated.

 @Input		ui32Value: 	The value to be written to the field - right aligned.

 @Return	None.

******************************************************************************/
#define ISPOST_REGIO_WRITE_FIELD_LITE(ui32RegValue, group, reg, field, ui32Value)			\
{																							\
	ISPOST_REGIO_CHECK_VALUE_FITS_WITHIN_FIELD(group,reg,field,ui32Value);					\
	(ui32RegValue) |= ( (ISPOST_UINT32) (ui32Value) << (group##_##reg##_##field##_SHIFT) );	\
}

/*!
******************************************************************************

 @Macro	ISPOST_REGIO_ENCODE_FIELD

 @Description

 This macro shifts a value to its correct position in a register. This is used
 for statically defining register values

 @Input		group: 		The name of the group containing the register into which
						the field is to be written.

 @Input		reg: 		The name of the register into which the field is to
						be written.

 @Input		field: 		The name of the field to be updated.
 @Input		ui32Value: 	The value to be written to the field - right aligned.

 @Return	None.

******************************************************************************/
#define ISPOST_REGIO_ENCODE_FIELD(group, reg, field, ui32Value)    \
                ( (ISPOST_UINT32) (ui32Value) << (group##_##reg##_##field##_SHIFT) )


#if defined(__cplusplus)
}
#endif //__cplusplus


#endif //__IMAPX800_ISPOST_APOLLO3_REGS_H__
